-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Sep 18, 2025 at 11:53 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hospi`
--
CREATE DATABASE IF NOT EXISTS `hospi` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `hospi`;

-- --------------------------------------------------------

--
-- Table structure for table `bills`
--

CREATE TABLE `bills` (
  `id` int(4) NOT NULL,
  `name` varchar(50) NOT NULL,
  `amount` float NOT NULL,
  `date_issued` date NOT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'غير مدفوع',
  `clinic_id` int(4) NOT NULL,
  `description` varchar(400) DEFAULT NULL,
  `bill_section` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `bills`
--

INSERT INTO `bills` (`id`, `name`, `amount`, `date_issued`, `status`, `clinic_id`, `description`, `bill_section`) VALUES
(17, 'ماتريال ', 1420, '2025-08-28', 'غير مدفوع', 7, '', 'مرافق'),
(18, 'ايجار شقة', 20000, '2025-09-01', 'غير مدفوع', 7, '', 'إيجار'),
(19, 'matrial', 5000, '2025-09-02', 'غير مدفوع', 7, '', 'مرافق'),
(20, 'كهرباء', 2000, '2025-09-02', 'غير مدفوع', 7, '', 'مرافق'),
(21, 'كهرباء ', 599, '2025-09-05', 'غير مدفوع', 6, '', 'مرافق'),
(22, 'شحن ', 344, '2025-09-05', 'غير مدفوع', 7, '', 'مرافق'),
(23, 'ايجار', 2000, '2025-09-06', 'غير مدفوع', 7, '', 'مرافق'),
(24, 'كهرباء', 52145, '2025-06-09', 'غير مدفوع', 7, '', 'مرافق');

-- --------------------------------------------------------

--
-- Table structure for table `clinics`
--

CREATE TABLE `clinics` (
  `clinic_id` int(5) NOT NULL,
  `Email` varchar(255) NOT NULL,
  `name_clinic` varchar(100) NOT NULL,
  `password` varchar(50) NOT NULL,
  `phone_numbers` int(200) NOT NULL,
  `addresses` varchar(200) NOT NULL,
  `date_add` TIMESTAMP NOT NULL DEFAULT current_timestamp(),
  `sections_id` int(50) NOT NULL,
  `plan_id` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `clinics`
--

INSERT INTO `clinics` (`clinic_id`, `Email`, `name_clinic`, `password`, `phone_numbers`, `addresses`, `date_add`, `sections_id`, `plan_id`) VALUES
(6, 'omar@gmail.com', 'omar clinic', '1234', 1550010435, '6 october', '2024-10-25', 0, NULL),
(7, 'ahmed@gmail.com', 'مستشفى الشيخ زايد المركزي ', '1234', 1550029874, '6 october ', '2024-10-26', 0, 1),
(8, 'Ahbaa_Alhayah@gmail.com', 'Ahbaa Alhayah ', '01117790869', 1117790869, 'Edkou,Albuhayrah,Egypt', '2024-12-03', 0, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `doctor`
--

CREATE TABLE `doctor` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(100) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `phone` varchar(11) NOT NULL,
  `examination_fee` int(5) NOT NULL,
  `review_fee` int(5) NOT NULL,
  `section_id` int(11) NOT NULL,
  `current_patient` int(11) DEFAULT NULL,
  `total_visits_today` int(5) DEFAULT NULL,
  `total_visits_month` int(5) DEFAULT NULL,
  `clinic_id` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `doctor`
--

INSERT INTO `doctor` (`id`, `username`, `password`, `name`, `phone`, `examination_fee`, `review_fee`, `section_id`, `current_patient`, `total_visits_today`, `total_visits_month`, `clinic_id`) VALUES
(38, 'OMAR', '1234', 'OMAR HOSNY', '', 500, 0, 36, NULL, NULL, NULL, 6),
(39, 'ahmed  ', '1234', ' احمد سامح عبدالله', '', 500, 0, 37, NULL, NULL, NULL, 7),
(40, 'reda', '1234', 'reda abo al majed ', '', 500, 0, 38, 151, NULL, NULL, 7),
(41, 'fatma', '1234', 'fatma namish', '', 500, 0, 39, 150, NULL, NULL, 7),
(42, 'ahemd_fahme\\y', '1234', 'ahmed fahmy', '', 500, 0, 40, NULL, NULL, NULL, 6),
(43, 'Ahmed_Fahmy', '01205123400', 'Ahmed Fahmy', '', 500, 0, 65, 144, NULL, NULL, 8),
(44, 'Tamer_Allam', '01117790869', 'Tamer Allam', '', 500, 0, 55, NULL, NULL, NULL, 8),
(45, 'Mohamed_Khamis', '01155008055', 'Mohamed Khamis', '', 500, 0, 42, 156, NULL, NULL, 8),
(46, 'basel', '1234', 'باسل على ', '', 500, 0, 70, NULL, NULL, NULL, 7),
(47, 'ahmed_nady', '1234', 'ahmed', '', 500, 0, 71, NULL, NULL, NULL, 7),
(48, 'sami@gmail.com', '1234', 'سامي', '', 500, 0, 72, NULL, NULL, NULL, 7),
(49, 'momen@gmail.com', '1234', 'مؤمن ', '', 500, 0, 74, 183, NULL, NULL, 7),
(50, 'saad', '1234', 'سعد عمر ', '14804180147', 500, 100, 72, NULL, NULL, NULL, 7),
(51, 'hosam@gmail.com', '1234', 'حسام عمر ', '65465432541', 500, 200, 39, NULL, NULL, NULL, 7),
(52, 'reda@gmail.com', '1234', 'رضا على', '02702857857', 700, 100, 75, NULL, NULL, NULL, 7),
(53, 'omarhosny@gmail.com', '1234', 'عمر حسني ', '29492479724', 800, 200, 76, NULL, NULL, NULL, 6),
(54, 'radiiahmed@gmail.com', '1234', 'راضي احمد', '22442423424', 900, 100, 74, NULL, NULL, NULL, 7),
(55, 'asem@gmail.com', '1234', 'عاصم ', '02840284024', 200, 50, 80, 210, NULL, NULL, 7);

-- --------------------------------------------------------

--
-- Table structure for table `featurs`
--

CREATE TABLE `featurs` (
  `id` int(11) NOT NULL,
  `code` varchar(80) NOT NULL,
  `discreption` varchar(80) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `featurs`
--

INSERT INTO `featurs` (`id`, `code`, `discreption`) VALUES
(1, 'add_bill', 'add bills\r\n'),
(2, 'clinic_report', 'clinic_report');

-- --------------------------------------------------------

--
-- Table structure for table `featursplans`
--

CREATE TABLE `featursplans` (
  `id` int(11) NOT NULL,
  `plan_id` int(4) NOT NULL,
  `featur_id` int(4) NOT NULL,
  `allowed` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `featursplans`
--

INSERT INTO `featursplans` (`id`, `plan_id`, `featur_id`, `allowed`) VALUES
(1, 1, 1, 1),
(2, 1, 2, 1);

-- --------------------------------------------------------

--
-- Table structure for table `invoice`
--

CREATE TABLE `invoice` (
  `id` int(4) NOT NULL,
  `visit_id` int(4) NOT NULL,
  `clinic_id` int(4) NOT NULL,
  `invoice_date` datetime NOT NULL DEFAULT current_timestamp(),
  `amount` int(11) NOT NULL,
  `discount` float DEFAULT NULL,
  `total_amount` int(5) NOT NULL,
  `status` varchar(10) NOT NULL DEFAULT 'غير مدفوع',
  `paid_amount` int(5) DEFAULT NULL,
  `remaining_amount` int(7) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `invoice`
--

INSERT INTO `invoice` (`id`, `visit_id`, `clinic_id`, `invoice_date`, `amount`, `discount`, `total_amount`, `status`, `paid_amount`, `remaining_amount`) VALUES
(1, 288, 7, '2025-09-02 14:40:07', 8350, 10, 7515, 'غير مدفوع', 400, 0),
(2, 288, 7, '2025-09-02 14:40:07', 0, 0, 0, 'غير مدفوع', 0, 0),
(3, 288, 7, '2025-09-02 14:40:07', 0, 0, 0, 'غير مدفوع', 0, 0),
(4, 290, 7, '2025-09-02 14:40:07', 1150, 10, 1035, 'مدفوع', 1035, 0),
(5, 290, 7, '2025-09-02 14:40:07', 0, 0, 0, 'غير مدفوع', 0, 0),
(6, 291, 7, '2025-09-02 15:39:52', 1500, 10, 1350, 'مدفوع', 1350, 0),
(7, 292, 7, '2025-09-03 08:54:06', 500, 0, 500, 'غير مدفوع', 350, 150),
(8, 293, 6, '2025-09-03 15:04:43', 900, 0, 900, 'غير مدفوع', 100, 0),
(9, 298, 7, '2025-09-05 13:07:03', 1300, 0, 1300, 'غير مدفوع', 0, 0),
(10, 297, 7, '2025-09-05 13:07:17', 500, 0, 500, 'غير مدفوع', 0, 0),
(11, 299, 7, '2025-09-07 09:15:56', 470, 7, 437, 'غير مدفوع', 300, 0),
(12, 301, 7, '2025-09-08 08:10:51', 3000, 0, 3000, 'غير مدفوع', 0, 0),
(13, 303, 7, '2025-09-09 06:24:38', 3000, 0, 3000, 'غير مدفوع', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `patient`
--

CREATE TABLE `patient` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `normalized_name` varchar(255) NOT NULL,
  `phone` varchar(11) NOT NULL,
  `section` int(11) NOT NULL,
  `age` int(5) NOT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `status` varchar(50) NOT NULL,
  `national_id` varchar(14) NOT NULL,
  `doctor_id` int(11) NOT NULL,
  `date_seen` datetime DEFAULT current_timestamp(),
  `date_visit` date NOT NULL,
  `clinic_id` int(20) NOT NULL,
  `clinics_visited` text DEFAULT NULL,
  `berth_date` year(4) NOT NULL,
  `process_id` int(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `patient`
--

INSERT INTO `patient` (`id`, `name`, `normalized_name`, `phone`, `section`, `age`, `gender`, `status`, `national_id`, `doctor_id`, `date_seen`, `date_visit`, `clinic_id`, `clinics_visited`, `berth_date`, `process_id`) VALUES
(112, 'samsom', '', '1550010435', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 09:16:32', '2025-05-22', 6, NULL, '2000', 1),
(115, 'marwan', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:19:54', '2025-05-22', 6, NULL, '2000', 1),
(116, 'abdallah', '', '1234567324', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:23:39', '2025-05-22', 6, NULL, '2000', 1),
(117, 'mario', '', '1234567324', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:25:07', '2025-05-22', 6, NULL, '2000', 1),
(118, 'marido', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:26:38', '2025-05-22', 6, NULL, '2000', 1),
(119, 'mario ahmed', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:54:16', '2025-05-22', 6, NULL, '2000', 1),
(120, 'mario ahmed', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 12:54:21', '2025-05-22', 6, NULL, '2000', 1),
(121, 'ramy omar', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 14:55:58', '2025-05-22', 6, NULL, '2000', 1),
(122, 'RAHMA AHMED', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 14:58:13', '2025-05-22', 6, NULL, '2000', 1),
(123, 'RAHMA AHMEN', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 14:59:54', '2025-05-22', 6, NULL, '2000', 1),
(124, 'RAHMA AHMEN', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:01:09', '2025-05-22', 6, NULL, '2000', 1),
(125, 'RAHMA AHMop', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:01:31', '2025-05-22', 6, NULL, '2000', 1),
(126, 'RAHMA AHned', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:05:47', '2025-05-22', 6, NULL, '2000', 1),
(127, 'ahMA AHned', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:06:33', '2025-05-22', 6, NULL, '2000', 1),
(128, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:08:06', '2025-05-22', 6, NULL, '2000', 1),
(129, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:38:05', '2025-05-22', 6, NULL, '2000', 1),
(130, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:38:37', '2025-05-22', 6, NULL, '2000', 1),
(131, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:39:04', '2025-05-22', 6, NULL, '2000', 1),
(132, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:39:49', '2025-05-22', 6, NULL, '2000', 1),
(133, 'mazen ahmed ', '', '2147483647', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:40:05', '2025-05-22', 6, NULL, '2000', 1),
(134, 'mario', '', '1234567321', 0, 0, NULL, '', '2147483647', 38, '2024-10-31 15:59:13', '2025-05-22', 6, NULL, '2002', 1),
(135, 'mona ali', '', '1234567323', 0, 0, 'Female', '', '2147483647', 38, '2024-10-31 16:22:19', '2025-05-22', 6, NULL, '2002', 1),
(136, 'mona ali', '', '1234567325', 0, 22, 'Male', '', '2147483647', 38, '2024-10-31 17:34:42', '2025-05-22', 6, NULL, '2002', 1),
(137, 'tamer', '', '1550010437', 0, 24, 'Male', '', '2147483647', 39, '2024-11-01 02:25:36', '2025-05-22', 7, NULL, '2000', 1),
(138, 'abdelmenem ', '', '1550010496', 0, 13, 'Male', '', '2147483647', 40, '2024-11-01 02:26:29', '2025-05-22', 7, NULL, '2010', 1),
(139, 'samah', '', '1234567320', 0, 21, 'Female', '', '2147483647', 39, '2024-11-03 10:35:38', '2025-05-22', 7, NULL, '2003', 1),
(140, 'ABLDFH ', '', '1234567324', 0, 23, 'Male', '', '2147483647', 39, '2024-11-03 19:37:35', '2025-05-22', 7, NULL, '2001', 1),
(141, 'fatam reda ', '', '1234561324', 0, 24, 'Female', '', '2147483647', 41, '2024-11-07 10:31:01', '2025-05-22', 7, NULL, '2000', 1),
(142, 'ahmed fahmy ', '', '1234567895', 0, 21, 'Male', '', '2147483647', 38, '2024-12-03 12:15:39', '2025-05-22', 6, NULL, '2003', 1),
(143, 'ahmed fahmy ', '', '1236567895', 0, 23, 'Male', '', '2147483647', 42, '2024-12-03 12:16:14', '2025-05-22', 6, NULL, '2001', 1),
(144, 'Omar Hosny', '', '1550010496', 0, 24, 'Male', '', '2147483647', 43, '2024-12-03 12:44:44', '2025-05-22', 8, NULL, '2000', 1),
(145, 'Akram Hosny', '', '1523698751', 0, 29, 'Male', '', '2147483647', 44, '2024-12-03 12:45:43', '2025-05-22', 8, NULL, '1995', 1),
(146, 'Hasnaa Hosny', '', '1256987456', 0, 24, 'Female', '', '2147483647', 45, '2024-12-03 12:47:18', '2025-05-22', 8, NULL, '1999', 1),
(147, 'Basma saied', '', '1554723075', 0, 29, 'Female', '', '2147483647', 45, '2024-12-03 12:53:10', '2025-05-22', 8, NULL, '1995', 1),
(148, 'samia ali', '', '1155008055', 0, 28, 'Female', '', '2147483647', 45, '2024-12-03 13:03:29', '2025-05-22', 8, NULL, '1995', 1),
(149, 'samia ali', '', '1155008055', 0, 28, 'Female', '', '2147483647', 38, '2024-12-03 13:05:30', '2025-05-22', 6, NULL, '1995', 1),
(150, 'samia ali', '', '1155008055', 0, 24, 'Male', '', '2147483647', 39, '2024-12-03 15:50:10', '2025-05-22', 7, NULL, '2000', 1),
(151, 'Hasnaa Hosny', '', '1550010496', 0, 24, 'Male', '', '2147483647', 40, '2024-12-03 15:55:07', '2025-05-22', 7, NULL, '2000', 1),
(152, 'samia ahmed', '', '1550010499', 0, 24, 'Male', '', '21255204180371', 39, '2024-12-04 14:43:34', '2025-05-22', 7, NULL, '2000', 1),
(153, 'ahmed ramdan', '', '1550010492', 0, 24, 'Male', '', '01234567891234', 40, '2024-12-04 18:46:42', '2025-05-22', 7, NULL, '2000', 1),
(154, 'رحمة احمد', '', '1550010490', 37, 24, 'Female', '', '01234567891236', 39, '2024-12-04 19:36:33', '2025-05-22', 7, NULL, '2000', 1),
(155, 'سامح رمضان ', '', '1550075245', 42, 24, 'Male', '', '07894563210123', 45, '2024-12-05 16:08:14', '2025-05-22', 8, NULL, '2000', 1),
(156, 'خالد محمد ', '', '1554474685', 42, 20, 'Male', '', '01257562145892', 45, '2024-12-05 16:13:02', '2025-05-22', 8, NULL, '2004', 1),
(157, 'سماح ابراهيم', '', '1438276235', 39, 69, 'Male', '', '02147569874152', 41, '2025-02-02 20:38:13', '2025-05-22', 7, NULL, '1955', 1),
(158, 'عصام احمد', '', '1287453584', 37, 35, 'Male', '', '08545971253145', 39, '2025-02-02 21:00:23', '2025-05-22', 7, NULL, '1989', 1),
(159, 'ahmed', '', '1550010435', 37, 36, 'Male', '', '00187346274829', 39, '2025-02-02 21:07:17', '2025-05-22', 7, NULL, '1988', 1),
(160, 'عمر حسني', '', '1550010435', 37, 34, 'Male', '', '01827364571374', 39, '2025-02-03 13:55:55', '2025-05-22', 7, NULL, '1990', 1),
(161, 'رحمة احمد', '', '1550010435', 37, 21, 'Male', '', '02147569874158', 39, '2025-02-04 01:21:58', '2025-05-22', 7, NULL, '2004', 1),
(162, 'samsom', '', '1550010435', 37, 23, 'Male', '', '00187346274827', 39, '2025-02-04 01:25:30', '2025-05-22', 7, NULL, '2002', 1),
(163, 'رحمة ', '', '1550010435', 37, 22, 'Male', '', '00187346274829', 39, '2025-02-04 01:37:07', '2025-05-22', 7, NULL, '2003', 1),
(164, 'رحمة ', '', '1550010430', 37, 22, 'Male', '', '00187346274849', 39, '2025-02-04 01:39:40', '2025-05-22', 7, NULL, '2003', 1),
(165, 'عمر حسني', '', '1098756321', 37, 17, 'Male', '', '00187346274829', 39, '2025-02-04 01:43:50', '2025-05-22', 7, NULL, '2008', 1),
(166, 'عمر حسني', '', '1550010474', 37, 20, 'Male', '', '00187346274886', 39, '2025-02-04 01:52:11', '2025-05-22', 7, NULL, '2005', 1),
(167, 'رحمة ', '', '1234567896', 39, 20, 'Female', '', '00187346274820', 41, '2025-02-04 01:58:22', '2025-05-22', 7, NULL, '2005', 1),
(168, 'ahmed', '', '01234567894', 39, 22, 'Male', '', '00187346274829', 41, '2025-02-04 02:03:35', '2025-05-22', 7, NULL, '2003', 1),
(169, 'ahmed', '', '01550010474', 39, 22, 'Male', '', '22187346274829', 41, '2025-02-04 02:05:31', '2025-05-22', 7, NULL, '2003', 1),
(170, 'رحمة احمد', '', '01550010474', 70, 23, 'Male', '', '01827364571372', 46, '2025-02-22 19:20:39', '2025-05-22', 7, NULL, '2002', 1),
(171, 'عطية اشرف ', '', '01550010242', 37, 25, 'Male', '', '20982043502489', 39, '2025-02-27 22:10:59', '2025-05-22', 7, NULL, '2000', 1),
(172, 'عطيبة اشرف ', '', '08108408493', 38, 25, 'Male', '', '24249297249792', 40, '2025-02-27 22:20:51', '2025-05-22', 7, NULL, '2000', 1),
(173, 'سلمى عمر ', '', '20890248084', 39, 25, 'Male', '', '02840824048208', 41, '2025-02-27 22:27:45', '2025-05-22', 7, NULL, '2000', 1),
(174, 'تامر علي ', '', '90430294029', 38, 24, 'Male', '', '02948029480948', 40, '2025-02-27 22:29:56', '2025-05-22', 7, NULL, '2000', 1),
(175, 'سالم عمر ', '', '39485037405', 37, 24, 'Male', '', '03950398450938', 39, '2025-02-27 22:31:21', '2025-05-22', 7, NULL, '2000', 1),
(176, 'احمد علي', '', '02408208240', 37, 24, 'Male', '', '08350285080280', 39, '2025-02-27 22:32:08', '2025-05-22', 7, NULL, '2000', 1),
(177, 'حسن احمد', '', '01554474568', 72, 18, 'Male', '', '20130016300156', 48, '2025-05-30 21:24:47', '2025-05-22', 7, NULL, '2007', 1),
(178, 'أسماء مرؤة علئ', 'اسماء مروه علي', '01224457456', 72, 24, 'Female', '', '36436546463543', 48, '2025-06-01 04:01:54', '2025-05-22', 7, NULL, '2001', 1),
(179, 'أحمد حمادة علئ', 'احمد حماده علي', '01244434134', 72, 25, 'Male', '', '31344646446466', 48, '2025-06-01 04:34:49', '2025-05-22', 7, NULL, '2000', 1),
(180, 'أسامة علئ عطية', 'اسامه علي عطيه', '01256464646', 72, 25, 'Male', '', '02081888526251', 48, '2025-06-01 04:45:57', '2025-05-22', 7, NULL, '2000', 1),
(181, 'أسماء سامية علئ', 'اسماء ساميه علي', '03463464343', 72, 24, 'Male', '', '03540634706340', 48, '2025-06-01 04:48:13', '2025-05-22', 7, NULL, '2000', 1),
(182, 'علي احمد صالح', 'علي احمد صالح', '01380138018', 72, 25, 'Male', '', '92844892480240', 48, '2025-06-01 13:35:08', '2025-05-22', 7, NULL, '2000', 1),
(183, 'ألاء أحمد ', 'الاء احمد ', '03541354168', 72, 25, 'Male', '', '35168416816816', 48, '2025-06-09 23:53:39', '2025-05-22', 7, NULL, '2000', 1),
(184, 'ألزهراء علئ سامية', 'الزهراء علي ساميه', '02940249204', 72, 25, 'Male', '', '02402040248024', 48, '2025-06-10 03:43:20', '2025-05-22', 7, NULL, '2000', 1),
(185, 'أسماء علئ سامية ', 'اسماء علي ساميه ', '01490410148', 72, 24, 'Male', '', '20840824084084', 48, '2025-06-10 03:48:59', '2025-05-22', 7, NULL, '2000', 1),
(186, 'سامي على أحمد', 'سامي علي احمد', '04028520852', 72, 25, 'Male', '', '', 48, '2025-06-16 18:37:08', '2025-05-22', 7, NULL, '2000', 1),
(187, 'سامح احمد علي', 'سامح احمد علي', '40920520580', 72, 25, 'Male', '', '', 48, '2025-06-16 18:37:38', '2025-05-22', 7, NULL, '2000', 1),
(188, 'سامي ياسر احمد', 'سامي ياسر احمد', '02480248208', 72, 25, 'Male', '', '', 48, '2025-06-16 18:39:55', '2025-05-22', 7, NULL, '2000', 1),
(189, 'سالم عمر ', 'سالم عمر ', '01546843516', 72, 1997, 'Male', '', '', 48, '2025-06-18 20:43:56', '2025-05-22', 7, NULL, '1999', 1),
(190, 'سالم عمر احمد', 'سالم عمر احمد', '34616836843', 72, 1996, 'Male', '', '', 48, '2025-06-18 20:44:42', '2025-05-22', 7, NULL, '1999', 1),
(191, 'سالم سامح', 'سالم سامح', '20408240840', 70, 1998, 'Male', '', '', 46, '2025-06-18 20:45:29', '2025-05-22', 7, NULL, '1999', 1),
(192, 'سالم سامى', 'سالم سامي', '29489249249', 72, 1996, 'Male', '', '', 48, '2025-06-18 20:47:18', '2025-05-22', 7, NULL, '1999', 1),
(193, 'سامح أحمد علئ', 'سامح احمد علي', '20402848024', 72, 34, 'Male', '', '', 48, '2025-06-18 21:03:52', '2025-05-22', 7, NULL, '1999', 1),
(194, 'سلمى سامي', 'سلمي سامي', '20482048240', 72, 37, 'Male', '', '', 48, '2025-06-18 21:14:50', '2025-05-22', 7, NULL, '1999', 1),
(195, 'سلمى احمد', 'سلمي احمد', '20482084082', 72, 28, 'Male', '', '', 48, '2025-06-19 14:58:15', '2025-05-22', 7, NULL, '1997', 1),
(196, 'أسماء عمر سامح ', 'اسماء عمر سامح ', '24020480428', 70, 28, 'Male', '', '', 46, '2025-06-19 14:58:47', '2025-05-22', 7, NULL, '1997', 1),
(197, 'سلمى عمر حسن', 'سلمي عمر حسن', '02801810808', 72, 29, 'Male', '', '', 48, '2025-06-19 15:22:53', '2025-05-22', 7, NULL, '1996', 1),
(198, 'سالم عمر صالح', 'سالم عمر صالح', '20482058520', 72, 26, 'Male', '', '', 48, '2025-06-19 15:23:12', '2025-05-22', 7, NULL, '1999', 1),
(199, 'عمر سامح على', 'عمر سامح علي', '02482408408', 72, 30, 'Male', '', '', 48, '2025-06-21 02:52:24', '2025-05-22', 7, NULL, '1995', 1),
(200, 'سماح على ', 'سماح علي ', '20408240824', 72, 38, 'Female', 'كشف', '', 50, '2025-06-22 04:20:35', '2025-05-22', 7, NULL, '1987', 1),
(201, 'يوسف احمد', 'يوسف احمد', '20840284028', 72, 29, 'Male', 'كشف', '', 48, '2025-06-23 11:56:23', '2025-05-22', 7, NULL, '1996', 1),
(202, 'عمر سالم على', 'عمر سالم علي', '20482084028', 36, 37, 'Male', 'كشف', '', 38, '2025-06-27 18:34:00', '2025-05-22', 6, NULL, '1988', NULL),
(203, 'عمرو احمد', 'عمرو احمد', '24082408208', 36, 50, 'Male', 'كشف', '', 38, '2025-06-27 19:52:23', '2025-05-22', 6, NULL, '1975', NULL),
(204, 'ahmed reda', 'عطيه اشرف ', '67847847478', 36, 33, 'Male', 'كشف', '', 38, '2025-06-27 19:56:51', '2025-05-22', 6, NULL, '1992', NULL),
(205, 'احمد سليم عمر ', 'احمد سليم عمر ', '02402840248', 74, 27, 'Male', 'كشف', '', 49, '2025-07-05 14:08:03', '2025-05-22', 7, NULL, '1998', NULL),
(206, 'سالم احمد رمضان ', 'سالم احمد رمضان ', '20802840248', 74, 28, 'Male', 'كشف', '', 49, '2025-07-05 14:10:37', '2025-05-22', 7, NULL, '1997', NULL),
(207, 'سلمى عمر رضى', 'سلمي عمر رضي', '20402840243', 74, 24, 'Male', 'كشف', '', 49, '2025-07-05 14:13:52', '2025-05-22', 7, NULL, '2001', NULL),
(208, 'راضي عمر احمد', 'راضي عمر احمد', '20480284024', 74, 28, 'Male', 'كشف', '', 49, '2025-07-05 14:23:18', '2025-05-22', 7, NULL, '1997', NULL),
(209, 'سالم عمر احمد', 'سالم عمر احمد', '02884028402', 72, 28, 'Male', 'كشف', '20482048208420', 48, '2025-07-12 11:13:08', '2025-07-12', 7, NULL, '1997', NULL),
(210, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', '20820482048', 72, 23, 'Male', 'كشف', '', 48, '2025-07-12 21:03:08', '2025-07-15', 7, NULL, '2002', NULL),
(211, 'احمد راضي ', 'احمد راضي ', '20840482048', 74, 28, 'Male', 'كشف', '', 49, '2025-07-12 21:21:20', '2025-07-13', 7, NULL, '1997', NULL),
(212, 'عمر رمضان حميل', 'عمر رمضان حميل', '20820482048', 39, 28, 'Male', 'كشف', '', 51, '2025-07-12 21:22:13', '2025-07-28', 7, NULL, '1997', NULL),
(213, 'ياسر عمر احمد', 'ياسر عمر احمد', '20482048028', 80, 28, 'Male', 'كشف', '', 55, '2025-08-30 12:06:27', '2025-08-30', 7, NULL, '1997', 1),
(214, 'ياسر على صالح', 'ياسر علي صالح', '24208402840', 80, 38, 'Male', 'كشف', '', 55, '2025-08-30 12:09:17', '2025-08-30', 7, NULL, '1987', 1),
(215, 'علي عمر يوسف', 'علي عمر يوسف', '20480024808', 80, 48, 'Male', 'كشف', '', 55, '2025-08-30 12:33:50', '2025-08-30', 7, NULL, '1977', 1),
(216, 'يوسف عمر علي', 'يوسف عمر علي', '92202802802', 80, 23, 'Male', 'كشف', '', 55, '2025-08-30 12:36:29', '2025-08-30', 7, NULL, '2002', 1),
(217, 'عمري علي احمد', 'عمري علي احمد', '29440824082', 80, 27, 'Male', 'كشف', '', 55, '2025-08-30 12:38:31', '2025-08-30', 7, NULL, '1998', 6),
(218, 'سشبصشثلشقل', 'سشبصشثلشقل', '21245345345', 80, 23, 'Male', 'كشف', '', 55, '2025-08-30 12:39:35', '2025-08-30', 7, NULL, '2002', 1),
(219, 'سبشبشق', 'سبشبشق', '24242553553', 80, 34, 'Male', 'كشف', '', 55, '2025-08-31 05:57:33', '2025-08-31', 7, NULL, '1991', 1),
(220, 'ياسين احمد عمر', 'ياسين احمد عمر', '20023080128', 80, 20, 'Male', 'كشف', '', 55, '2025-09-05 12:55:10', '2025-09-05', 7, NULL, '2005', NULL),
(221, 'احمد يوسف علي', 'احمد يوسف علي', '02480248042', 80, 48, 'Male', 'كشف', '', 55, '2025-09-05 12:57:19', '2025-09-05', 7, NULL, '1977', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` int(5) NOT NULL,
  `patient_id` int(5) NOT NULL,
  `id_clinic` int(4) NOT NULL,
  `visit_id` int(5) NOT NULL,
  `idprocess` int(4) DEFAULT NULL,
  `process_cost` int(5) DEFAULT NULL,
  `discount` int(5) DEFAULT NULL,
  `paid_amount` int(5) NOT NULL,
  `remaining_amount` int(5) NOT NULL,
  `method` varchar(50) DEFAULT 'كاش',
  `payment_date` TIMESTAMP NOT NULL DEFAULT current_timestamp(),
  `invoice_id` int(5) NOT NULL,
  `payment_date_time` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `patient_id`, `id_clinic`, `visit_id`, `idprocess`, `process_cost`, `discount`, `paid_amount`, `remaining_amount`, `method`, `payment_date`, `invoice_id`, `payment_date_time`) VALUES
(1, 183, 7, 291, NULL, NULL, NULL, 77600, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(2, 183, 7, 288, NULL, NULL, NULL, 500, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(3, 183, 7, 290, NULL, NULL, NULL, 24100, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(4, 183, 7, 291, NULL, NULL, NULL, 500, 68650, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(5, 183, 7, 290, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(6, 183, 7, 288, NULL, NULL, NULL, 2000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(7, 183, 7, 291, NULL, NULL, NULL, 1000, 69150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(8, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(9, 183, 7, 290, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(10, 183, 7, 291, NULL, NULL, NULL, 2000, 70150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(11, 183, 7, 290, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(12, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(13, 183, 7, 290, NULL, NULL, NULL, 1150, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(14, 183, 7, 288, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(15, 183, 7, 291, NULL, NULL, NULL, 0, 72150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(16, 183, 7, 291, NULL, NULL, NULL, 4000, 72150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(17, 183, 7, 290, NULL, NULL, NULL, 1150, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(18, 183, 7, 288, NULL, NULL, NULL, 150, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(19, 183, 7, 291, NULL, NULL, NULL, 800, 76150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(20, 183, 7, 290, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(21, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(22, 183, 7, 291, NULL, NULL, NULL, 100, 76950, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(23, 183, 7, 290, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(24, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(25, 183, 7, 288, NULL, NULL, NULL, 4350, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(26, 183, 7, 290, NULL, NULL, NULL, 2500, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(27, 183, 7, 291, NULL, NULL, NULL, 100, 77050, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(28, 183, 7, 291, NULL, NULL, NULL, -7500, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(29, 183, 7, 288, NULL, NULL, NULL, 8700, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(30, 183, 7, 290, NULL, NULL, NULL, 5000, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(31, 183, 7, 291, NULL, NULL, NULL, 1500, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(32, 183, 7, 288, NULL, NULL, NULL, -2000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(33, 183, 7, 290, NULL, NULL, NULL, -9000, 535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(34, 183, 7, 291, NULL, NULL, NULL, 3000, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(35, 183, 7, 288, NULL, NULL, NULL, -10000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(36, 183, 7, 290, NULL, NULL, NULL, 1000, 535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(37, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(38, 183, 7, 291, NULL, NULL, NULL, 6000, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(39, 183, 7, 290, NULL, NULL, NULL, 2000, 1535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(40, 183, 7, 291, NULL, NULL, NULL, 12000, 5050, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(41, 183, 7, 290, NULL, NULL, NULL, 4000, 3535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(42, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(43, 183, 7, 288, NULL, NULL, NULL, 7400, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(44, 183, 7, 291, NULL, NULL, NULL, 24000, 17050, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(45, 183, 7, 290, NULL, NULL, NULL, 1000, 7535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(46, 183, 7, 291, NULL, NULL, NULL, -48000, 41050, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(47, 183, 7, 288, NULL, NULL, NULL, 14800, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(48, 183, 7, 290, NULL, NULL, NULL, 9000, 8535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(49, 183, 7, 290, NULL, NULL, NULL, -18000, 17535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(50, 183, 7, 291, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(51, 183, 7, 288, NULL, NULL, NULL, -29600, 9715, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(52, 183, 7, 290, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(53, 183, 7, 291, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(54, 183, 7, 288, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(55, 183, 7, 290, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(56, 183, 7, 288, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(57, 183, 7, 291, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(58, 183, 7, 291, NULL, NULL, NULL, 2000, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(59, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(60, 183, 7, 290, NULL, NULL, NULL, 1000, 1535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(61, 183, 7, 291, NULL, NULL, NULL, 4000, 77150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(62, 183, 7, 288, NULL, NULL, NULL, 200, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(63, 183, 7, 290, NULL, NULL, NULL, 2000, 2535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(64, 183, 7, 291, NULL, NULL, NULL, 8000, 81150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:44:42'),
(65, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:44:42'),
(66, 183, 7, 290, NULL, NULL, NULL, 4000, 2735, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:44:42'),
(67, 183, 7, 290, NULL, NULL, NULL, 32100, 6735, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:49:00'),
(68, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:49:00'),
(69, 183, 7, 291, NULL, NULL, NULL, 93100, 89150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:49:00'),
(70, 183, 7, 291, NULL, NULL, NULL, 186200, 184900, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 21:50:06'),
(71, 183, 7, 290, NULL, NULL, NULL, 64200, 38835, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 21:50:06'),
(72, 183, 7, 288, NULL, NULL, NULL, 122, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 21:50:06'),
(73, 183, 7, 291, NULL, NULL, NULL, 100, 371100, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:37:18'),
(74, 183, 7, 288, NULL, NULL, NULL, 1122, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:37:18'),
(75, 183, 7, 290, NULL, NULL, NULL, 128400, 103035, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:37:18'),
(76, 183, 7, 291, NULL, NULL, NULL, 372500, 371200, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:37:39'),
(77, 183, 7, 288, NULL, NULL, NULL, 2244, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:37:39'),
(78, 183, 7, 290, NULL, NULL, NULL, 256800, 231435, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:37:39'),
(79, 183, 7, 291, NULL, NULL, NULL, -745000, 743700, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:37:56'),
(80, 183, 7, 290, NULL, NULL, NULL, -513600, 488235, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:37:56'),
(81, 183, 7, 288, NULL, NULL, NULL, -4488, 2003, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:37:56'),
(82, 183, 7, 291, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:38:15'),
(83, 183, 7, 290, NULL, NULL, NULL, 1150, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:38:15'),
(84, 183, 7, 288, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:38:15'),
(85, 183, 7, 291, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:38:31'),
(86, 183, 7, 288, NULL, NULL, NULL, 2000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:38:31'),
(87, 183, 7, 290, NULL, NULL, NULL, 1150, 0, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:38:31'),
(88, 183, 7, 291, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:48:26'),
(89, 183, 7, 290, NULL, NULL, NULL, 0, 2735, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:48:26'),
(90, 183, 7, 288, NULL, NULL, NULL, 2000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:48:26'),
(91, 183, 7, 291, NULL, NULL, NULL, 0, 0, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:48:50'),
(92, 183, 7, 290, NULL, NULL, NULL, -2300, 5035, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:48:50'),
(93, 183, 7, 288, NULL, NULL, NULL, -4000, 2415, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:48:50'),
(94, 183, 7, 288, NULL, NULL, NULL, 0, 2415, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:49:02'),
(95, 183, 7, 291, NULL, NULL, NULL, 0, 184900, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:49:02'),
(96, 183, 7, 290, NULL, NULL, NULL, 100, 4535, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:49:02'),
(97, 183, 7, 288, NULL, NULL, NULL, 142, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 22:49:13'),
(98, 183, 7, 291, NULL, NULL, NULL, 0, 184900, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 22:49:13'),
(99, 183, 7, 290, NULL, NULL, NULL, 100, 4635, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 22:49:13'),
(100, 183, 7, 291, NULL, NULL, NULL, 100, 184800, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:02:17'),
(101, 183, 7, 290, NULL, NULL, NULL, 200, 4735, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 23:02:17'),
(102, 183, 7, 288, NULL, NULL, NULL, 142, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:02:17'),
(103, 183, 7, 291, NULL, NULL, NULL, 100, 182250, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:15:08'),
(104, 183, 7, 288, NULL, NULL, NULL, 284, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:15:08'),
(105, 183, 7, 290, NULL, NULL, NULL, 150, 4935, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 23:15:08'),
(106, 183, 7, 291, NULL, NULL, NULL, 200, 182350, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:15:35'),
(107, 183, 7, 288, NULL, NULL, NULL, 100, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:15:35'),
(108, 183, 7, 290, NULL, NULL, NULL, 550, 5085, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 23:15:35'),
(109, 183, 7, 291, NULL, NULL, NULL, -300, 182550, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:27:52'),
(110, 183, 7, 291, NULL, NULL, NULL, 400, 182250, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:28:08'),
(111, 183, 7, 288, NULL, NULL, NULL, 332, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:28:49'),
(112, 183, 7, 290, NULL, NULL, NULL, -1050, 5635, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 23:29:42'),
(113, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:30:42'),
(114, 183, 7, 291, NULL, NULL, NULL, 500, 182650, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:31:33'),
(115, 183, 7, 291, NULL, NULL, NULL, 200, 183150, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:32:58'),
(116, 183, 7, 291, NULL, NULL, NULL, 100, 183350, 'تحديث حساب', '2025-09-02', 6, '2025-09-02 23:33:50'),
(117, 183, 7, 288, NULL, NULL, NULL, 1000, 0, 'تحديث حساب', '2025-09-02', 1, '2025-09-02 23:33:51'),
(118, 183, 7, 290, NULL, NULL, NULL, 200, 4585, 'تحديث حساب', '2025-09-02', 4, '2025-09-02 23:33:51'),
(119, 183, 7, 291, NULL, NULL, NULL, 1350, 183450, 'كاش', '2025-09-02', 6, '2025-09-03 00:24:19'),
(120, 183, 7, 288, NULL, NULL, NULL, 3000, 0, 'كاش', '2025-09-02', 1, '2025-09-03 00:24:19'),
(121, 183, 7, 290, NULL, NULL, NULL, 250, 4785, 'كاش', '2025-09-02', 4, '2025-09-03 00:24:19'),
(122, 183, 7, 291, NULL, NULL, NULL, 2650, 0, 'كاش', '2025-09-02', 6, '2025-09-03 00:24:52'),
(123, 183, 7, 288, NULL, NULL, NULL, 6000, 1515, 'كاش', '2025-09-02', 1, '2025-09-03 00:24:52'),
(124, 183, 7, 290, NULL, NULL, NULL, 535, 0, 'كاش', '2025-09-02', 4, '2025-09-03 00:24:52'),
(125, 183, 7, 292, NULL, NULL, NULL, 100, 400, 'تحديث حساب', '2025-09-03', 7, '2025-09-03 17:41:54'),
(126, 183, 7, 291, NULL, NULL, NULL, 400, 0, 'تحديث حساب', '2025-09-03', 6, '2025-09-03 17:47:36'),
(127, 183, 7, 288, NULL, NULL, NULL, -16485, 12000, 'تحديث حساب', '2025-09-03', 1, '2025-09-03 17:48:05'),
(128, 183, 7, 288, NULL, NULL, NULL, 4485, 7515, 'تحديث حساب', '2025-09-03', 1, '2025-09-03 17:49:49'),
(129, 183, 7, 292, NULL, NULL, NULL, 150, 250, 'كاش', '2025-09-03', 7, '2025-09-03 17:56:18'),
(130, 183, 7, 292, NULL, NULL, NULL, 100, 150, 'كاش', '2025-09-03', 7, '2025-09-03 17:56:48'),
(131, 183, 7, 288, NULL, NULL, NULL, 100, 7415, 'تحديث حساب', '2025-09-03', 1, '2025-09-03 17:57:25'),
(132, 183, 7, 291, NULL, NULL, NULL, -4350, 0, 'كاش', '2025-09-03', 6, '2025-09-03 17:59:20'),
(133, 183, 7, 288, NULL, NULL, NULL, 300, 7115, 'تحديث حساب', '2025-09-03', 1, '2025-09-03 23:35:30'),
(134, 202, 6, 293, NULL, NULL, NULL, 100, 800, 'كاش', '2025-09-05', 8, '2025-09-05 15:58:30'),
(135, 183, 7, 299, NULL, NULL, NULL, 200, 237, 'كاش', '2025-09-07', 11, '2025-09-07 12:17:00'),
(136, 183, 7, 299, NULL, NULL, NULL, 100, 137, 'كاش', '2025-09-07', 11, '2025-09-07 12:37:40');

-- --------------------------------------------------------

--
-- Table structure for table `percentages`
--

CREATE TABLE `percentages` (
  `id` int(4) NOT NULL,
  `doctor_id` int(4) NOT NULL,
  `process_id` int(4) NOT NULL,
  `percentage` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `percentages`
--

INSERT INTO `percentages` (`id`, `doctor_id`, `process_id`, `percentage`) VALUES
(1, 55, 6, 12),
(2, 51, 2, 23),
(3, 55, 1, 15),
(4, 40, 1, 15),
(5, 48, 1, 25);

-- --------------------------------------------------------

--
-- Table structure for table `plan`
--

CREATE TABLE `plan` (
  `id` int(3) NOT NULL,
  `name` varchar(25) NOT NULL,
  `discreption` varchar(50) NOT NULL,
  `active` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `plan`
--

INSERT INTO `plan` (`id`, `name`, `discreption`, `active`) VALUES
(1, 'pro', 'pro', 1);

-- --------------------------------------------------------

--
-- Table structure for table `procedure`
--

CREATE TABLE `procedure` (
  `id` int(4) NOT NULL,
  `process_id` int(4) NOT NULL,
  `visit_id` int(4) NOT NULL,
  `cost` int(5) NOT NULL,
  `description` text NOT NULL,
  `date_performed` datetime NOT NULL DEFAULT current_timestamp(),
  `discount` float DEFAULT NULL,
  `status` varchar(20) NOT NULL DEFAULT 'pending',
  `final_cost` int(5) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `procedure`
--

INSERT INTO `procedure` (`id`, `process_id`, `visit_id`, `cost`, `description`, `date_performed`, `discount`, `status`, `final_cost`) VALUES
(5, 6, 289, 1300, 'حشو عصب', '2025-08-31 18:02:26', 0, 'completed', 1300),
(7, 5, 288, 5000, 'جراحة باطنة  زراعة كبد', '2025-08-31 17:34:16', 10, 'completed', 4500),
(8, 3, 288, 500, 'جراحة باطنة  زراعة كبد', '2025-09-02 17:06:57', 100, 'completed', 0),
(9, 2, 288, 500, 'زراعة قلب', '2025-08-31 16:23:17', 0, 'completed', 500),
(10, 3, 290, 500, 'زراعة كبد', '2025-08-31 16:23:10', 0, 'completed', 500),
(11, 6, 290, 1300, 'حشو عصب', '2025-08-31 16:26:44', 50, 'completed', 650),
(12, 6, 288, 1300, 'حشو عصب سمينبت خميتبسميتبمست زراعة اسنان', '2025-09-02 18:16:17', 0, 'completed', 1300),
(13, 1, 288, 500, 'حشو عصب سمينبت خميتبسميتبمست زراعة اسنان', '2025-08-31 18:16:41', 50, 'completed', 250),
(14, 6, 289, 1300, 'حشو عصب وبعيد هنعمل بتاع يملاسكخيبشكمبيلتشكسم جراحة باطنة  كبتشكمسينتبكشمست زراعة اسنان', '2025-08-31 18:02:05', 0, 'completed', 1300),
(15, 5, 289, 5000, 'حشو عصب وبعيد هنعمل بتاع يملاسكخيبشكمبيلتشكسم جراحة باطنة  كبتشكمسينتبكشمست زراعة اسنان', '2025-08-31 18:02:02', 0, 'pending', 5000),
(16, 1, 289, 500, 'حشو عصب وبعيد هنعمل بتاع يملاسكخيبشكمبيلتشكسم جراحة باطنة  كبتشكمسينتبكشمست زراعة اسنان', '2025-08-31 18:01:49', 50, 'pending', 250),
(17, 2, 289, 500, 'زراعة قلب', '2025-08-31 18:03:06', 0, 'completed', 500),
(18, 6, 288, 1300, 'حشو عصب ونعمل زراعة اسنان', '2025-09-02 18:40:11', 0, 'completed', 1300),
(19, 1, 288, 500, 'حشو عصب ونعمل زراعة اسنان', '2025-09-02 18:37:40', 0, 'completed', 500),
(20, 5, 289, 5000, 'جراحة باطنة', '2025-08-31 18:45:15', 0, 'pending', 5000),
(21, 2, 291, 500, 'زراعة قلب', '2025-09-02 18:39:52', 0, 'completed', 500),
(22, 1, 291, 500, 'زراعة اسنان', '2025-09-02 18:47:05', 0, 'completed', 500),
(23, 3, 291, 500, 'زراعة كبد', '2025-09-02 20:19:41', 0, 'completed', 500),
(24, 1, 292, 500, 'زراعة اسنان', '2025-09-03 11:54:06', 0, 'completed', 500),
(25, 4, 293, 900, 'زراعة قلب', '2025-09-03 18:04:43', 0, 'completed', 900),
(26, 1, 297, 500, 'زراعة اسنان', '2025-09-05 16:07:17', 20, 'completed', 400),
(27, 6, 298, 1300, 'حشو عصب', '2025-09-05 16:07:03', 0, 'completed', 1300),
(28, 1, 299, 500, 'زراعة اسنان', '2025-09-07 12:15:56', 6, 'pending', 470),
(29, 8, 301, 3000, 'تعديل غضروف', '2025-09-08 11:10:51', 0, 'completed', 3000),
(30, 8, 303, 3000, 'تعديل غضروف', '2025-09-09 09:24:38', 0, 'completed', 3000);

-- --------------------------------------------------------

--
-- Table structure for table `process`
--

CREATE TABLE `process` (
  `id` int(4) NOT NULL,
  `name_process` varchar(50) NOT NULL,
  `fee_process` int(5) NOT NULL,
  `section_id` int(10) NOT NULL,
  `clinic_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `process`
--

INSERT INTO `process` (`id`, `name_process`, `fee_process`, `section_id`, `clinic_id`) VALUES
(1, 'زراعة اسنان', 500, 80, 7),
(2, 'زراعة قلب', 500, 39, 7),
(3, 'زراعة كبد', 500, 75, 7),
(4, 'زراعة قلب', 900, 76, 6),
(5, 'جراحة باطنة ', 5000, 78, 7),
(6, 'حشو عصب', 1300, 80, 7),
(7, 'جراحة عيون', 2456, 76, 6),
(8, 'تعديل غضروف ', 3000, 74, 7);

-- --------------------------------------------------------

--
-- Table structure for table `reception`
--

CREATE TABLE `reception` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `phone` varchar(11) NOT NULL,
  `clinic_id` int(4) NOT NULL,
  `email` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `reception`
--

INSERT INTO `reception` (`id`, `name`, `phone`, `clinic_id`, `email`, `password`) VALUES
(1, 'احمد عمر ', '01550014785', 7, 'ahmedomar@gmail.com', '1234'),
(2, 'سالم احمد', '02480284028', 7, 'salem@gmail.com', '1234'),
(3, 'جميل احمد', '93535085083', 7, 'gamel@gmail.com', '1234'),
(4, 'محمد علي ', '04802840482', 7, 'mohammed@gmail.com', '1234'),
(5, 'محمد', '62742582582', 7, 'mohamed@gmail.com', '1234'),
(6, 'عمر احمد', '29749749274', 6, 'omar_r@gmail.com', '1234'),
(7, 'ali ahmed', '24082040820', 7, 'aliahmed@gmail.com', '1234');

-- --------------------------------------------------------

--
-- Table structure for table `section`
--

CREATE TABLE `section` (
  `id` int(11) NOT NULL,
  `doctors_name` varchar(50) DEFAULT NULL,
  `clinic_id` int(20) NOT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `name_section` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `section`
--

INSERT INTO `section` (`id`, `doctors_name`, `clinic_id`, `doctor_id`, `name_section`) VALUES
(36, NULL, 6, 0, 'hart'),
(37, NULL, 7, 0, 'leg'),
(38, NULL, 7, 0, 'mind'),
(39, NULL, 7, 0, 'قلب '),
(40, NULL, 6, 0, 'leg '),
(41, NULL, 8, 0, 'Neurology'),
(42, NULL, 8, 0, 'Obstetrics & Gynaecology'),
(43, NULL, 8, 0, 'Cardiology'),
(44, NULL, 8, 0, 'Dermatology'),
(45, NULL, 8, 0, 'Gastroenterology'),
(46, NULL, 8, 0, 'Anesthesiology'),
(47, NULL, 8, 0, 'General Surgery'),
(48, NULL, 8, 0, 'Immunology & Hematology'),
(49, NULL, 8, 0, 'Nephrology'),
(50, NULL, 8, 0, 'Pediatrics'),
(51, NULL, 8, 0, 'Psychiatry'),
(52, NULL, 8, 0, 'Emergency'),
(53, NULL, 8, 0, 'Medical Genetics'),
(54, NULL, 8, 0, 'Orthopedics'),
(55, NULL, 8, 0, 'Pathology'),
(56, NULL, 8, 0, 'Critical Care'),
(57, NULL, 8, 0, 'Radiology'),
(58, NULL, 8, 0, 'Endocrinolgy'),
(59, NULL, 8, 0, 'Facial Plastic Surgery'),
(60, NULL, 8, 0, 'Internal Medicine'),
(61, NULL, 8, 0, 'Dentistry'),
(62, NULL, 8, 0, 'Cardiac Surgery'),
(63, NULL, 8, 0, 'Geriatrics'),
(64, NULL, 8, 0, 'Community'),
(65, NULL, 8, 0, 'Opthalmology'),
(66, NULL, 8, 0, 'Ent'),
(67, NULL, 8, 0, 'Forensic & Toxicology'),
(68, NULL, 8, 0, 'Chest'),
(69, NULL, 8, 0, 'Physical Therapy'),
(70, NULL, 7, NULL, 'عظام '),
(71, NULL, 7, NULL, 'etham'),
(72, NULL, 7, NULL, 'ضغط'),
(73, NULL, 7, NULL, 'كسوؤ '),
(74, NULL, 7, NULL, 'علاج طبيعي'),
(75, NULL, 7, NULL, 'كبد'),
(76, NULL, 6, NULL, 'ضغط'),
(77, NULL, 7, NULL, 'nural'),
(78, NULL, 7, NULL, 'جراحة '),
(79, NULL, 7, NULL, 'اي بتاع '),
(80, NULL, 7, NULL, 'اسنان ');

-- --------------------------------------------------------

--
-- Table structure for table `visit`
--

CREATE TABLE `visit` (
  `id` int(11) NOT NULL,
  `patient_name` varchar(100) NOT NULL,
  `normalized_name` varchar(255) NOT NULL,
  `patient_id` int(11) NOT NULL,
  `national_id` varchar(14) NOT NULL,
  `doctor_id` int(11) NOT NULL,
  `age` int(5) NOT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `status` varchar(50) NOT NULL,
  `patient_phone` varchar(11) NOT NULL,
  `section_id` int(11) NOT NULL,
  `visit_date` date NOT NULL,
  `visit_date_login` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `date_visit` date DEFAULT NULL,
  `visit_status` varchar(50) DEFAULT 'مؤكد',
  `clinic_id` int(20) DEFAULT NULL,
  `berth_date` year(4) NOT NULL,
  `process_id` int(4) DEFAULT NULL,
  `process_cost` int(5) DEFAULT NULL,
  `percentage` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `visit`
--

INSERT INTO `visit` (`id`, `patient_name`, `normalized_name`, `patient_id`, `national_id`, `doctor_id`, `age`, `gender`, `status`, `patient_phone`, `section_id`, `visit_date`, `visit_date_login`, `date_visit`, `visit_status`, `clinic_id`, `berth_date`, `process_id`, `process_cost`, `percentage`) VALUES
(118, 'samia ahmed', '', 152, '21255204180371', 39, 24, 'Male', '', '1550010499', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', NULL, NULL, 0),
(119, 'Omar Hosny', '', 144, '2147483647', 39, 24, 'Male', '', '1550010496', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(120, 'samia ali', '', 148, '2147483647', 39, 28, 'Female', '', '1155008055', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(121, 'samia ali', '', 148, '2147483647', 39, 28, 'Female', '', '1155008055', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(122, 'Omar Hosny', '', 144, '2147483647', 39, 24, 'Male', '', '1550010496', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(123, 'Omar Hosny', '', 144, '2147483647', 39, 24, 'Male', '', '1550010496', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(124, 'Omar Hosny', '', 144, '2147483647', 39, 24, 'Male', '', '1550010496', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(125, 'ahmed ramdan', '', 153, '01234567891234', 40, 24, 'Male', '', '1550010492', 38, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(126, 'Omar Hosny', '', 144, '2147483647', 41, 24, 'Male', '', '1550010496', 39, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(127, 'Hasnaa Hosny', '', 151, '2147483647', 39, 24, 'Male', '', '1550010496', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(128, 'رحمة احمد', '', 154, '01234567891236', 39, 24, 'Female', '', '1550010490', 37, '2024-12-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(129, 'سامح رمضان ', '', 155, '07894563210123', 45, 24, 'Male', '', '1550075245', 42, '2024-12-05', '2025-08-29 06:45:03', NULL, 'ongoing', 8, '2000', 1, NULL, 0),
(130, 'خالد محمد ', '', 156, '01257562145892', 45, 20, 'Male', '', '1554474685', 42, '2024-12-05', '2025-08-29 06:45:03', NULL, 'ongoing', 8, '2000', 1, NULL, 0),
(131, 'Hasnaa Hosny', '', 151, '2147483647', 38, 24, 'Male', '', '1550010496', 36, '2024-12-05', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(132, 'Omar Hosny', '', 144, '2147483647', 38, 24, 'Male', '', '1550010496', 36, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(133, 'سامح رمضان ', '', 155, '07894563210123', 38, 24, 'Male', '', '1550075245', 36, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(134, 'رحمة احمد', '', 154, '01234567891236', 38, 24, 'Female', '', '1550010490', 36, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(135, 'samia ahmed', '', 152, '21255204180371', 38, 24, 'Male', '', '1550010499', 36, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(136, 'خالد محمد ', '', 156, '01257562145892', 38, 20, 'Male', '', '1554474685', 36, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(137, 'خالد محمد ', '', 156, '01257562145892', 42, 20, 'Male', '', '1554474685', 40, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(138, 'Omar Hosny', '', 144, '2147483647', 42, 24, 'Male', '', '1550010496', 40, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(139, 'abdelmenem ', '', 138, '2147483647', 42, 13, 'Male', '', '1550010496', 40, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(141, 'Hasnaa Hosny', '', 151, '2147483647', 42, 24, 'Male', '', '1550010496', 40, '2024-12-06', '2025-08-29 06:45:03', NULL, 'ongoing', 6, '2000', 1, NULL, 0),
(142, 'سماح ابراهيم', '', 157, '02147569874152', 41, 69, 'Male', '', '1438276235', 39, '2025-02-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(143, 'عصام احمد', '', 158, '08545971253145', 39, 35, 'Male', '', '1287453584', 37, '2025-02-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(144, 'ahmed', '', 159, '00187346274829', 39, 36, 'Male', '', '1550010435', 37, '2025-02-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(145, 'سماح ابراهيم', '', 157, '02147569874152', 39, 69, 'Male', '', '1438276235', 37, '2025-02-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(146, 'عمر حسني', '', 160, '01827364571374', 39, 34, 'Male', '', '1550010435', 37, '2025-02-03', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(147, 'رحمة احمد', '', 161, '02147569874158', 39, 21, 'Male', '', '1550010435', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(148, 'samsom', '', 162, '00187346274827', 39, 23, 'Male', '', '1550010435', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(149, 'رحمة ', '', 163, '00187346274829', 39, 22, 'Male', '', '1550010435', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(150, 'رحمة ', '', 164, '00187346274849', 39, 22, 'Male', '', '1550010430', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(151, 'عمر حسني', '', 165, '00187346274829', 39, 17, 'Male', '', '1098756321', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(152, 'عمر حسني', '', 166, '00187346274886', 39, 20, 'Male', '', '1550010474', 37, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(153, 'رحمة ', '', 167, '00187346274820', 41, 20, 'Female', '', '1234567896', 39, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(154, 'ahmed', '', 168, '00187346274829', 41, 22, 'Male', '', '01234567894', 39, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(155, 'ahmed', '', 169, '22187346274829', 41, 22, 'Male', '', '01550010474', 39, '2025-02-04', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(156, 'samia ali', '', 150, '2147483647', 41, 24, 'Male', '', '1155008055', 39, '2025-02-07', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(157, 'Hasnaa Hosny', '', 151, '2147483647', 40, 24, 'Male', '', '1550010496', 38, '2025-02-07', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(158, 'Hasnaa Hosny', '', 151, '2147483647', 41, 24, 'Male', '', '1550010496', 39, '2025-02-07', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(159, 'رحمة احمد', '', 170, '01827364571372', 46, 23, 'Male', '', '01550010474', 70, '2025-02-22', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(160, 'عطية اشرف ', '', 171, '20982043502489', 40, 25, 'Male', '', '01550010242', 38, '2025-02-27', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(161, 'احمد علي', '', 176, '08350285080280', 39, 24, 'Male', '', '02408208240', 37, '2025-02-27', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(162, 'samia ali', '', 150, '2147483647', 40, 24, 'Male', '', '1155008055', 38, '2025-04-15', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(163, 'Omar Hosny', '', 144, '2147483647', 48, 24, 'Male', '', '1550010496', 72, '2025-04-15', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(164, 'سماح ابراهيم', '', 157, '02147569874152', 48, 69, 'Male', '', '1438276235', 72, '2025-04-16', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(165, 'رحمة ', '', 167, '00187346274820', 40, 20, 'Female', '', '1234567896', 38, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(166, 'رحمة ', '', 167, '00187346274820', 48, 20, 'Female', '', '1234567896', 72, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(167, 'samia ali', '', 148, '2147483647', 48, 28, 'Female', '', '1155008055', 72, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(168, 'mario', '', 117, '2147483647', 48, 0, 'None', '', '1234567324', 72, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(169, 'samsom', '', 162, '00187346274827', 48, 23, 'Male', '', '1550010435', 72, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(170, 'حسن احمد', '', 177, '20130016300156', 48, 18, 'Male', '', '01554474568', 72, '2025-05-30', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(171, 'أسماء مرؤة علئ', '', 178, '36436546463543', 48, 24, 'Female', '', '01224457456', 72, '2025-06-01', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(172, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 48, 24, 'Male', '', '03463464343', 72, '2025-06-01', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(173, 'علي احمد صالح', 'علي احمد صالح', 182, '92844892480240', 48, 25, 'Male', '', '01380138018', 72, '2025-06-01', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(174, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 39, 24, 'Male', '', '03463464343', 37, '2025-06-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(175, 'أسماء مرؤة علئ', 'اسماء مروه علي', 178, '36436546463543', 41, 24, 'Female', '', '01224457456', 39, '2025-06-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(176, 'أسماء مرؤة علئ', 'اسماء مروه علي', 178, '36436546463543', 39, 24, 'Female', '', '01224457456', 37, '2025-06-02', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(177, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 48, 24, 'Male', '', '03463464343', 72, '2025-06-09', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(178, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 47, 24, 'Male', '', '03463464343', 71, '2025-06-09', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(179, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 48, 24, 'Male', '', '03463464343', 72, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(180, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 41, 24, 'Male', '', '03463464343', 39, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(181, 'أسماء مرؤة علئ', 'اسماء مروه علي', 178, '36436546463543', 48, 24, 'Female', '', '01224457456', 72, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(182, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', '', '03541354168', 72, '2025-06-09', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(183, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', '', '03541354168', 72, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(184, 'ألزهراء علئ سامية', 'الزهراء علي ساميه', 184, '02402040248024', 48, 25, 'Male', '', '02940249204', 72, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(185, 'أسماء علئ سامية ', 'اسماء علي ساميه ', 185, '20840824084084', 48, 24, 'Male', '', '01490410148', 72, '2025-06-10', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(186, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', '', '03541354168', 72, '2025-06-11', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(187, 'سامي على أحمد', 'سامي علي احمد', 186, '', 48, 25, 'Male', '', '04028520852', 72, '2025-06-16', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(188, 'سامح احمد علي', 'سامح احمد علي', 187, '', 48, 25, 'Male', '', '40920520580', 72, '2025-06-16', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(189, 'سامي ياسر احمد', 'سامي ياسر احمد', 188, '', 48, 25, 'Male', '', '02480248208', 72, '2025-06-16', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(190, 'سلمى عمر حسن', 'سلمي عمر حسن', 197, '', 48, 29, 'Male', '', '02801810808', 72, '2025-06-19', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '1996', 1, NULL, 0),
(191, 'سالم عمر صالح', 'سالم عمر صالح', 198, '', 48, 26, 'Male', '', '20482058520', 72, '2025-06-19', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '1999', 1, NULL, 0),
(192, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', '', '03541354168', 72, '2025-06-21', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(193, 'عمر سامح على', 'عمر سامح علي', 199, '', 48, 30, 'Male', '', '02482408408', 72, '2025-06-21', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '1995', 1, NULL, 0),
(194, 'سماح على ', 'سماح علي ', 200, '', 50, 38, 'Female', 'كشف', '20408240824', 72, '2025-06-22', '2025-08-29 06:45:03', NULL, 'cancelled', 7, '1987', 1, NULL, 0),
(195, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 50, 25, 'Male', 'كشف', '03541354168', 72, '2025-06-22', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(196, 'يوسف احمد', 'يوسف احمد', 201, '', 48, 29, 'Male', 'كشف', '20840284028', 72, '2025-06-23', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '1996', 1, NULL, 0),
(197, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 51, 25, 'Male', 'كشف', '03541354168', 39, '2025-06-23', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 2, NULL, 0),
(198, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-06-25', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '2000', 1, NULL, 0),
(204, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'اعادة', '03541354168', 72, '2025-06-26', '2025-08-29 06:45:03', NULL, 'cancelled', 7, '2000', 1, NULL, 0),
(206, 'يوسف احمد', 'يوسف احمد', 201, '', 51, 29, 'Male', 'اعادة', '20840284028', 39, '2025-06-26', '2025-08-29 06:45:03', NULL, 'ongoing', 7, '1996', 2, NULL, 0),
(207, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'اعادة', '03541354168', 72, '2025-06-27', '2025-08-29 06:45:03', NULL, 'cancelled', 7, '2000', 1, NULL, 0),
(208, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 51, 25, 'Male', 'اعادة', '03541354168', 39, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 2, NULL, 0),
(209, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 48, 24, 'Male', 'كشف', '03463464343', 72, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 1, NULL, 0),
(210, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 50, 24, 'Male', 'كشف', '03463464343', 72, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 1, NULL, 0),
(211, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 41, 25, 'Male', 'كشف', '03541354168', 39, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 2, NULL, 0),
(212, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'كشف', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 2, NULL, 0),
(213, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 41, 25, 'Male', 'كشف', '03541354168', 39, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ongoing', NULL, '2000', 2, NULL, 0),
(214, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 48, 24, 'Male', 'كشف', '03463464343', 72, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ongoing', NULL, '2000', NULL, NULL, 0),
(215, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 40, 24, 'Male', 'كشف', '03463464343', 38, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ongoing', NULL, '2000', NULL, NULL, 0),
(216, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 46, 24, 'Male', 'اعادة', '03463464343', 70, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(217, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 46, 25, 'Male', 'كشف', '03541354168', 70, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(218, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(219, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 40, 25, 'Male', 'كشف', '03541354168', 38, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(220, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 40, 25, 'Male', 'كشف', '03541354168', 38, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(221, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'كشف', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(222, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'كشف', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', 2, NULL, 0),
(223, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 47, 25, 'Male', 'كشف', '03541354168', 71, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(224, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 52, 25, 'Male', 'اعادة', '03541354168', 75, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(225, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 52, 24, 'Male', 'اعادة', '03463464343', 75, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(226, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'اعادة', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', NULL, '2000', NULL, NULL, 0),
(227, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 39, 24, 'Male', 'اعادة', '03463464343', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(228, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 39, 24, 'Male', 'اعادة', '03463464343', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(229, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'اعادة', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(230, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 39, 24, 'Male', 'اعادة', '03463464343', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(231, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'اعادة', '03541354168', 37, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(232, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 53, 25, 'Male', 'اعادة', '03541354168', 76, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '2000', 4, NULL, 0),
(233, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 53, 24, 'Male', 'اعادة', '03463464343', 76, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', 4, NULL, 0),
(234, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 38, 24, 'Male', 'كشف', '03463464343', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(235, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 42, 24, 'Male', 'اعادة', '03463464343', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '2000', NULL, NULL, 0),
(236, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 42, 25, 'Male', 'اعادة', '03541354168', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(237, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 38, 25, 'Male', 'اعادة', '03541354168', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(238, 'أسماء سامية علئ', 'اسماء ساميه علي', 181, '03540634706340', 42, 24, 'Male', 'اعادة', '03463464343', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(239, 'سامي على أحمد', 'سامي علي احمد', 186, '', 38, 25, 'Male', 'اعادة', '04028520852', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(240, 'سامي على أحمد', 'سامي علي احمد', 186, '', 42, 25, 'Male', 'كشف', '04028520852', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(241, 'عمر سالم على', 'عمر سالم علي', 202, '', 38, 37, 'Male', 'كشف', '20482084028', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1988', NULL, NULL, 0),
(242, 'عمر سالم على', 'عمر سالم علي', 202, '', 42, 37, 'Male', 'كشف', '20482084028', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1988', NULL, NULL, 0),
(243, 'عمر سالم على', 'عمر سالم علي', 202, '', 53, 37, 'Male', 'كشف', '20482084028', 76, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '1988', NULL, NULL, 0),
(244, 'عمر سالم على', 'عمر سالم علي', 202, '', 53, 37, 'Male', 'اعادة', '20482084028', 76, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1988', NULL, NULL, 0),
(245, 'عمر سالم على', 'عمر سالم علي', 202, '', 38, 37, 'Male', 'اعادة', '20482084028', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '1988', NULL, NULL, 0),
(246, 'عمرو احمد', 'عمرو احمد', 203, '', 38, 50, 'Male', 'كشف', '24082408208', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1975', NULL, NULL, 0),
(247, 'عطية اشرف ', 'عطيه اشرف ', 204, '', 38, 33, 'Male', 'كشف', '67847847478', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1992', NULL, NULL, 0),
(248, 'عطية اشرف ', 'عطيه اشرف ', 204, '', 42, 33, 'Male', 'كشف', '67847847478', 40, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1992', NULL, NULL, 0),
(249, 'عمر سالم على', 'عمر سالم علي', 202, '', 38, 37, 'Male', 'اعادة', '20482084028', 36, '2025-06-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 6, '1988', NULL, NULL, 0),
(250, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-06-30', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', 1, NULL, 0),
(251, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-06-30', '2025-08-29 06:45:03', NULL, 'مؤكد', NULL, '2000', NULL, NULL, 0),
(252, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'كشف', '03541354168', 37, '2025-06-30', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(253, 'احمد سليم عمر ', 'احمد سليم عمر ', 205, '', 49, 27, 'Male', 'كشف', '02402840248', 74, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '1998', NULL, NULL, 0),
(254, 'سالم احمد رمضان ', 'سالم احمد رمضان ', 206, '', 49, 28, 'Male', 'كشف', '20802840248', 74, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '1997', NULL, NULL, 0),
(255, 'سلمى عمر رضى', 'سلمي عمر رضي', 207, '', 49, 24, 'Male', 'كشف', '20402840243', 74, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2001', NULL, NULL, 0),
(256, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(257, 'سلمى عمر رضى', 'سلمي عمر رضي', 207, '', 48, 24, 'Male', 'كشف', '20402840243', 72, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2001', NULL, NULL, 0),
(258, 'راضي عمر احمد', 'راضي عمر احمد', 208, '', 49, 28, 'Male', 'كشف', '20480284024', 74, '2025-07-05', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '1997', NULL, NULL, 0),
(259, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-07-12', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(260, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-07-12', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(261, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 51, 25, 'Male', 'كشف', '03541354168', 39, '2025-07-12', '2025-08-29 06:45:03', '2025-07-22', 'مؤكد', 7, '2000', NULL, NULL, 0),
(262, 'سالم عمر احمد', 'سالم عمر احمد', 209, '20482048208420', 48, 28, 'Male', 'كشف', '02884028402', 72, '2025-07-12', '2025-08-29 06:45:03', '2025-07-12', 'مؤكد', 7, '1997', NULL, NULL, 0),
(263, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 46, 25, 'Male', 'كشف', '03541354168', 70, '2025-07-12', '2025-08-29 06:45:03', '2025-05-22', 'مؤكد', 7, '2000', NULL, NULL, 0),
(264, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 48, 23, 'Male', 'كشف', '20820482048', 72, '2025-07-15', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(265, 'احمد راضي ', 'احمد راضي ', 211, '', 49, 28, 'Male', 'كشف', '20840482048', 74, '2025-07-13', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '1997', NULL, NULL, 0),
(266, 'عمر رمضان حميل', 'عمر رمضان حميل', 212, '', 51, 28, 'Male', 'كشف', '20820482048', 39, '2025-07-28', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '1997', NULL, NULL, 0),
(267, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 39, 25, 'Male', 'كشف', '03541354168', 37, '2025-07-13', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(268, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 46, 25, 'Male', 'كشف', '03541354168', 70, '2025-07-13', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(269, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-07-28', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(270, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-07-25', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(271, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 48, 25, 'Male', 'كشف', '03541354168', 72, '2025-07-13', '2025-08-29 06:45:03', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(272, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-08-17', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(273, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 49, 23, 'Male', 'كشف', '20820482048', 74, '2025-08-17', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(274, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'اعادة', '03541354168', 80, '2025-08-24', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', 6, NULL, 0),
(275, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'اعادة', '20820482048', 80, '2025-08-24', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2002', 6, NULL, 0),
(276, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'اعادة', '03541354168', 80, '2025-08-25', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', 6, NULL, 0),
(277, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'اعادة', '03541354168', 80, '2025-08-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', 6, NULL, 0),
(278, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 51, 25, 'Male', 'اعادة', '03541354168', 39, '2025-08-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2000', 2, NULL, 0),
(279, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 51, 23, 'Male', 'اعادة', '20820482048', 39, '2025-08-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2002', 2, NULL, 0),
(280, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'اعادة', '20820482048', 80, '2025-08-27', '2025-08-29 06:45:03', NULL, 'مؤكد', 7, '2002', 1, NULL, 0),
(281, 'ياسر عمر احمد', 'ياسر عمر احمد', 213, '', 55, 28, 'Male', 'كشف', '20482048028', 80, '2025-08-30', '2025-08-30 12:06:27', NULL, 'مؤكد', 7, '1997', 1, NULL, 0),
(282, 'ياسر على صالح', 'ياسر علي صالح', 214, '', 55, 38, 'Male', 'كشف', '24208402840', 80, '2025-08-30', '2025-08-30 12:09:17', NULL, 'مؤكد', 7, '1987', 1, NULL, 0),
(283, 'علي عمر يوسف', 'علي عمر يوسف', 215, '', 55, 48, 'Male', 'كشف', '20480024808', 80, '2025-08-30', '2025-08-30 12:33:50', NULL, 'مؤكد', 7, '1977', 1, NULL, 0),
(284, 'يوسف عمر علي', 'يوسف عمر علي', 216, '', 55, 23, 'Male', 'كشف', '92202802802', 80, '2025-08-30', '2025-08-30 12:36:29', NULL, 'مؤكد', 7, '2002', 1, NULL, 0),
(285, 'عمري علي احمد', 'عمري علي احمد', 217, '', 55, 27, 'Male', 'كشف', '29440824082', 80, '2025-08-30', '2025-08-30 12:38:31', NULL, 'مؤكد', 7, '1998', 6, NULL, 0),
(286, 'سشبصشثلشقل', 'سشبصشثلشقل', 218, '', 55, 23, 'Male', 'كشف', '21245345345', 80, '2025-08-30', '2025-08-30 12:39:35', NULL, 'مؤكد', 7, '2002', 1, NULL, 0),
(287, 'سبشبشق', 'سبشبشق', 219, '', 55, 34, 'Male', 'كشف', '24242553553', 80, '2025-08-31', '2025-08-31 08:26:24', NULL, 'ملغي', 7, '1991', 1, NULL, 0),
(288, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-08-31', '2025-08-31 06:14:51', NULL, 'مؤكد', 7, '2000', 1, NULL, 0),
(289, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'كشف', '20820482048', 80, '2025-08-31', '2025-08-31 09:26:23', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(290, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'كشف', '03541354168', 74, '2025-08-31', '2025-08-31 12:24:21', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(291, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'اعادة', '03541354168', 80, '2025-09-02', '2025-09-02 13:30:01', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(292, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-03', '2025-09-03 15:09:44', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(293, 'عمر سالم على', 'عمر سالم علي', 202, '', 53, 37, 'Male', 'كشف', '20482084028', 76, '2025-09-03', '2025-09-03 15:03:17', NULL, 'مؤكد', 6, '1988', NULL, NULL, 0),
(294, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 53, 25, 'Male', 'كشف', '03541354168', 76, '2025-09-03', '2025-09-03 15:12:51', NULL, 'مؤكد', 6, '2000', 4, NULL, 0),
(295, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-05', '2025-09-05 12:52:14', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(296, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-05', '2025-09-05 12:54:42', NULL, 'ملغي', 7, '2000', NULL, NULL, 0),
(297, 'ياسين احمد عمر', 'ياسين احمد عمر', 220, '', 55, 20, 'Male', 'كشف', '20023080128', 80, '2025-09-05', '2025-09-05 13:08:08', NULL, 'ملغي', 7, '2005', NULL, NULL, 0),
(298, 'احمد يوسف علي', 'احمد يوسف علي', 221, '', 55, 48, 'Male', 'كشف', '02480248042', 80, '2025-09-05', '2025-09-05 13:07:31', NULL, 'ملغي', 7, '1977', NULL, NULL, 0),
(299, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-07', '2025-09-07 09:15:15', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(300, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 49, 25, 'Male', 'اعادة', '03541354168', 74, '2025-09-08', '2025-09-08 08:03:15', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(301, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 54, 25, 'Male', 'كشف', '03541354168', 74, '2025-09-08', '2025-09-08 08:03:47', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(302, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-09', '2025-09-09 06:16:19', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(303, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'كشف', '20820482048', 80, '2025-09-09', '2025-09-09 06:19:43', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(304, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-15', '2025-09-15 11:27:07', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(305, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'كشف', '20820482048', 80, '2025-09-15', '2025-09-15 11:28:07', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(306, 'احمد يوسف علي', 'احمد يوسف علي', 221, '', 55, 48, 'Male', 'كشف', '02480248042', 80, '2025-09-15', '2025-09-15 16:07:14', NULL, 'مؤكد', 7, '1977', NULL, NULL, 0),
(307, 'ألاء أحمد ', 'الاء احمد ', 183, '35168416816816', 55, 25, 'Male', 'كشف', '03541354168', 80, '2025-09-16', '2025-09-15 21:04:35', NULL, 'مؤكد', 7, '2000', NULL, NULL, 0),
(308, 'خالد احمد الغزولي ', 'خالد احمد الغزولي ', 210, '', 55, 23, 'Male', 'كشف', '20820482048', 80, '2025-09-16', '2025-09-15 21:05:08', NULL, 'مؤكد', 7, '2002', NULL, NULL, 0),
(309, 'احمد يوسف علي', 'احمد يوسف علي', 221, '', 55, 48, 'Male', 'كشف', '02480248042', 80, '2025-09-16', '2025-09-15 21:05:45', NULL, 'مؤكد', 7, '1977', NULL, NULL, 0),
(310, 'ياسر عمر احمد', 'ياسر عمر احمد', 213, '', 55, 28, 'Male', 'كشف', '20482048028', 80, '2025-09-16', '2025-09-15 21:06:33', NULL, 'مؤكد', 7, '1997', NULL, NULL, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bills`
--
ALTER TABLE `bills`
  ADD PRIMARY KEY (`id`),
  ADD KEY `clinic_id_2` (`clinic_id`);

--
-- Indexes for table `clinics`
--
ALTER TABLE `clinics`
  ADD PRIMARY KEY (`clinic_id`),
  ADD UNIQUE KEY `name_clinic` (`name_clinic`),
  ADD UNIQUE KEY `phone_numbers` (`phone_numbers`),
  ADD UNIQUE KEY `Email` (`Email`);

--
-- Indexes for table `doctor`
--
ALTER TABLE `doctor`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD KEY `id` (`id`,`username`,`password`,`name`,`section_id`),
  ADD KEY `clinic_id` (`clinic_id`),
  ADD KEY `FK_sectionID` (`section_id`),
  ADD KEY `doctor_ibfk_1` (`current_patient`);

--
-- Indexes for table `featurs`
--
ALTER TABLE `featurs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `code` (`code`);

--
-- Indexes for table `featursplans`
--
ALTER TABLE `featursplans`
  ADD PRIMARY KEY (`id`),
  ADD KEY `feature_id` (`featur_id`),
  ADD KEY `plan_id` (`plan_id`);

--
-- Indexes for table `invoice`
--
ALTER TABLE `invoice`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_visit` (`visit_id`),
  ADD KEY `clinicid` (`clinic_id`),
  ADD KEY `remaining_amount` (`remaining_amount`),
  ADD KEY `discount` (`discount`);

--
-- Indexes for table `patient`
--
ALTER TABLE `patient`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_clinic` (`clinic_id`),
  ADD KEY `name` (`name`),
  ADD KEY `phone` (`phone`),
  ADD KEY `section` (`section`),
  ADD KEY `national_id` (`national_id`),
  ADD KEY `fk_doctor_id` (`doctor_id`),
  ADD KEY `gender` (`gender`),
  ADD KEY `age` (`age`),
  ADD KEY `section_2` (`section`),
  ADD KEY `berth_date` (`berth_date`),
  ADD KEY `status` (`status`),
  ADD KEY `process_id` (`process_id`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `patient_id` (`patient_id`),
  ADD KEY `visit_id` (`visit_id`),
  ADD KEY `cost_process` (`process_cost`),
  ADD KEY `discount` (`discount`),
  ADD KEY `idprocess` (`idprocess`),
  ADD KEY `idclinic` (`id_clinic`),
  ADD KEY `invoice_id` (`invoice_id`),
  ADD KEY `remaining_amount` (`remaining_amount`);

--
-- Indexes for table `percentages`
--
ALTER TABLE `percentages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `doctor_id` (`doctor_id`),
  ADD KEY `percentage` (`percentage`),
  ADD KEY `process` (`process_id`);

--
-- Indexes for table `plan`
--
ALTER TABLE `plan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `active` (`active`);

--
-- Indexes for table `procedure`
--
ALTER TABLE `procedure`
  ADD PRIMARY KEY (`id`),
  ADD KEY `processid` (`process_id`),
  ADD KEY `visitid` (`visit_id`);

--
-- Indexes for table `process`
--
ALTER TABLE `process`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fee_process` (`fee_process`),
  ADD KEY `section_id` (`section_id`),
  ADD KEY `id_clinic` (`clinic_id`);

--
-- Indexes for table `reception`
--
ALTER TABLE `reception`
  ADD PRIMARY KEY (`id`),
  ADD KEY `clinic_id` (`clinic_id`);

--
-- Indexes for table `section`
--
ALTER TABLE `section`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`) USING BTREE,
  ADD KEY `fk_clinic_section` (`clinic_id`),
  ADD KEY `naem_section` (`name_section`) USING BTREE,
  ADD KEY `doctors_name` (`doctors_name`);

--
-- Indexes for table `visit`
--
ALTER TABLE `visit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_visit_clinic_id` (`clinic_id`),
  ADD KEY `patient_phone` (`patient_phone`),
  ADD KEY `section_id` (`section_id`),
  ADD KEY `visit_ibfk_1` (`patient_id`),
  ADD KEY `visit_ibfk_2` (`doctor_id`),
  ADD KEY `visit_ibfk_3` (`patient_name`),
  ADD KEY `FK_gender` (`gender`),
  ADD KEY `FK_age` (`age`),
  ADD KEY `national_id_FK` (`national_id`),
  ADD KEY `berth_date` (`berth_date`),
  ADD KEY `status` (`status`),
  ADD KEY `id_process` (`process_id`),
  ADD KEY `process_cost` (`process_cost`),
  ADD KEY `percentage` (`percentage`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bills`
--
ALTER TABLE `bills`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `clinics`
--
ALTER TABLE `clinics`
  MODIFY `clinic_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `doctor`
--
ALTER TABLE `doctor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `featurs`
--
ALTER TABLE `featurs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `featursplans`
--
ALTER TABLE `featursplans`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `invoice`
--
ALTER TABLE `invoice`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `patient`
--
ALTER TABLE `patient`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=222;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=137;

--
-- AUTO_INCREMENT for table `percentages`
--
ALTER TABLE `percentages`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `plan`
--
ALTER TABLE `plan`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `procedure`
--
ALTER TABLE `procedure`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `process`
--
ALTER TABLE `process`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `reception`
--
ALTER TABLE `reception`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `section`
--
ALTER TABLE `section`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `visit`
--
ALTER TABLE `visit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=311;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `featursplans`
--
ALTER TABLE `featursplans`
  ADD CONSTRAINT `feature_id` FOREIGN KEY (`featur_id`) REFERENCES `featurs` (`id`),
  ADD CONSTRAINT `plan_id` FOREIGN KEY (`plan_id`) REFERENCES `plan` (`id`);

--
-- Constraints for table `invoice`
--
ALTER TABLE `invoice`
  ADD CONSTRAINT `clinicid` FOREIGN KEY (`clinic_id`) REFERENCES `clinics` (`clinic_id`),
  ADD CONSTRAINT `id_visit` FOREIGN KEY (`visit_id`) REFERENCES `visit` (`id`);

--
-- Constraints for table `patient`
--
ALTER TABLE `patient`
  ADD CONSTRAINT `process_id` FOREIGN KEY (`process_id`) REFERENCES `process` (`id`);

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `cost_process` FOREIGN KEY (`process_cost`) REFERENCES `process` (`fee_process`),
  ADD CONSTRAINT `discount` FOREIGN KEY (`discount`) REFERENCES `visit` (`percentage`),
  ADD CONSTRAINT `idclinic` FOREIGN KEY (`id_clinic`) REFERENCES `clinics` (`clinic_id`),
  ADD CONSTRAINT `idprocess` FOREIGN KEY (`idprocess`) REFERENCES `visit` (`process_id`),
  ADD CONSTRAINT `invoice_id` FOREIGN KEY (`invoice_id`) REFERENCES `invoice` (`id`),
  ADD CONSTRAINT `patient_id` FOREIGN KEY (`patient_id`) REFERENCES `patient` (`id`),
  ADD CONSTRAINT `visit_id` FOREIGN KEY (`visit_id`) REFERENCES `visit` (`id`);

--
-- Constraints for table `percentages`
--
ALTER TABLE `percentages`
  ADD CONSTRAINT `doctor_id` FOREIGN KEY (`doctor_id`) REFERENCES `doctor` (`id`),
  ADD CONSTRAINT `process` FOREIGN KEY (`process_id`) REFERENCES `process` (`id`);

--
-- Constraints for table `procedure`
--
ALTER TABLE `procedure`
  ADD CONSTRAINT `processid` FOREIGN KEY (`process_id`) REFERENCES `process` (`id`),
  ADD CONSTRAINT `visitid` FOREIGN KEY (`visit_id`) REFERENCES `visit` (`id`);

--
-- Constraints for table `process`
--
ALTER TABLE `process`
  ADD CONSTRAINT `id_clinic` FOREIGN KEY (`clinic_id`) REFERENCES `clinics` (`clinic_id`),
  ADD CONSTRAINT `section_id` FOREIGN KEY (`section_id`) REFERENCES `section` (`id`);

--
-- Constraints for table `reception`
--
ALTER TABLE `reception`
  ADD CONSTRAINT `clinic_id` FOREIGN KEY (`clinic_id`) REFERENCES `clinics` (`clinic_id`);

--
-- Constraints for table `visit`
--
ALTER TABLE `visit`
  ADD CONSTRAINT `berth_date` FOREIGN KEY (`berth_date`) REFERENCES `patient` (`berth_date`),
  ADD CONSTRAINT `id_process` FOREIGN KEY (`process_id`) REFERENCES `process` (`id`),
  ADD CONSTRAINT `process_cost` FOREIGN KEY (`process_cost`) REFERENCES `process` (`fee_process`);
--
-- Database: `phpmyadmin`
--
-- CREATE DATABASE IF NOT EXISTS `phpmyadmin` DEFAULT CHARACTER SET utf8 COLLATE utf8_bin;
-- USE `phpmyadmin`;

-- --------------------------------------------------------

--
-- Table structure for table `pma__bookmark`
--

CREATE TABLE `pma__bookmark` (
  `id` int(11) NOT NULL,
  `dbase` varchar(255) NOT NULL DEFAULT '',
  `user` varchar(255) NOT NULL DEFAULT '',
  `label` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `query` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Bookmarks';

-- --------------------------------------------------------

--
-- Table structure for table `pma__central_columns`
--

CREATE TABLE `pma__central_columns` (
  `db_name` varchar(64) NOT NULL,
  `col_name` varchar(64) NOT NULL,
  `col_type` varchar(64) NOT NULL,
  `col_length` text DEFAULT NULL,
  `col_collation` varchar(64) NOT NULL,
  `col_isNull` tinyint(1) NOT NULL,
  `col_extra` varchar(255) DEFAULT '',
  `col_default` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Central list of columns';

-- --------------------------------------------------------

--
-- Table structure for table `pma__column_info`
--

CREATE TABLE `pma__column_info` (
  `id` int(5) UNSIGNED NOT NULL,
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `column_name` varchar(64) NOT NULL DEFAULT '',
  `comment` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `mimetype` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `transformation` varchar(255) NOT NULL DEFAULT '',
  `transformation_options` varchar(255) NOT NULL DEFAULT '',
  `input_transformation` varchar(255) NOT NULL DEFAULT '',
  `input_transformation_options` varchar(255) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Column information for phpMyAdmin';

-- --------------------------------------------------------

--
-- Table structure for table `pma__designer_settings`
--

CREATE TABLE `pma__designer_settings` (
  `username` varchar(64) NOT NULL,
  `settings_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Settings related to Designer';

-- --------------------------------------------------------

--
-- Table structure for table `pma__export_templates`
--

CREATE TABLE `pma__export_templates` (
  `id` int(5) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL,
  `export_type` varchar(10) NOT NULL,
  `template_name` varchar(64) NOT NULL,
  `template_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Saved export templates';

--
-- Dumping data for table `pma__export_templates`
--

INSERT INTO `pma__export_templates` (`id`, `username`, `export_type`, `template_name`, `template_data`) VALUES
(1, 'root', 'server', 'medicalhub', '{\"quick_or_custom\":\"quick\",\"what\":\"sql\",\"db_select[]\":[\"hospi\",\"phpmyadmin\",\"test\"],\"aliases_new\":\"\",\"output_format\":\"sendit\",\"filename_template\":\"@SERVER@\",\"remember_template\":\"on\",\"charset\":\"utf-8\",\"compression\":\"none\",\"maxsize\":\"\",\"codegen_structure_or_data\":\"data\",\"codegen_format\":\"0\",\"csv_separator\":\",\",\"csv_enclosed\":\"\\\"\",\"csv_escaped\":\"\\\"\",\"csv_terminated\":\"AUTO\",\"csv_null\":\"NULL\",\"csv_columns\":\"something\",\"csv_structure_or_data\":\"data\",\"excel_null\":\"NULL\",\"excel_columns\":\"something\",\"excel_edition\":\"win\",\"excel_structure_or_data\":\"data\",\"json_structure_or_data\":\"data\",\"json_unicode\":\"something\",\"latex_caption\":\"something\",\"latex_structure_or_data\":\"structure_and_data\",\"latex_structure_caption\":\"Structure of table @TABLE@\",\"latex_structure_continued_caption\":\"Structure of table @TABLE@ (continued)\",\"latex_structure_label\":\"tab:@TABLE@-structure\",\"latex_relation\":\"something\",\"latex_comments\":\"something\",\"latex_mime\":\"something\",\"latex_columns\":\"something\",\"latex_data_caption\":\"Content of table @TABLE@\",\"latex_data_continued_caption\":\"Content of table @TABLE@ (continued)\",\"latex_data_label\":\"tab:@TABLE@-data\",\"latex_null\":\"\\\\textit{NULL}\",\"mediawiki_structure_or_data\":\"data\",\"mediawiki_caption\":\"something\",\"mediawiki_headers\":\"something\",\"htmlword_structure_or_data\":\"structure_and_data\",\"htmlword_null\":\"NULL\",\"ods_null\":\"NULL\",\"ods_structure_or_data\":\"data\",\"odt_structure_or_data\":\"structure_and_data\",\"odt_relation\":\"something\",\"odt_comments\":\"something\",\"odt_mime\":\"something\",\"odt_columns\":\"something\",\"odt_null\":\"NULL\",\"pdf_report_title\":\"\",\"pdf_structure_or_data\":\"data\",\"phparray_structure_or_data\":\"data\",\"sql_include_comments\":\"something\",\"sql_header_comment\":\"\",\"sql_use_transaction\":\"something\",\"sql_compatibility\":\"NONE\",\"sql_structure_or_data\":\"structure_and_data\",\"sql_create_table\":\"something\",\"sql_auto_increment\":\"something\",\"sql_create_view\":\"something\",\"sql_create_trigger\":\"something\",\"sql_backquotes\":\"something\",\"sql_type\":\"INSERT\",\"sql_insert_syntax\":\"both\",\"sql_max_query_size\":\"50000\",\"sql_hex_for_binary\":\"something\",\"sql_utc_time\":\"something\",\"texytext_structure_or_data\":\"structure_and_data\",\"texytext_null\":\"NULL\",\"yaml_structure_or_data\":\"data\",\"\":null,\"as_separate_files\":null,\"csv_removeCRLF\":null,\"excel_removeCRLF\":null,\"json_pretty_print\":null,\"htmlword_columns\":null,\"ods_columns\":null,\"sql_dates\":null,\"sql_relation\":null,\"sql_mime\":null,\"sql_disable_fk\":null,\"sql_views_as_tables\":null,\"sql_metadata\":null,\"sql_drop_database\":null,\"sql_drop_table\":null,\"sql_if_not_exists\":null,\"sql_simple_view_export\":null,\"sql_view_current_user\":null,\"sql_or_replace_view\":null,\"sql_procedure_function\":null,\"sql_truncate\":null,\"sql_delayed\":null,\"sql_ignore\":null,\"texytext_columns\":null}');

-- --------------------------------------------------------

--
-- Table structure for table `pma__favorite`
--

CREATE TABLE `pma__favorite` (
  `username` varchar(64) NOT NULL,
  `tables` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Favorite tables';

-- --------------------------------------------------------

--
-- Table structure for table `pma__history`
--

CREATE TABLE `pma__history` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL DEFAULT '',
  `db` varchar(64) NOT NULL DEFAULT '',
  `table` varchar(64) NOT NULL DEFAULT '',
  `timevalue` timestamp NOT NULL DEFAULT current_timestamp(),
  `sqlquery` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='SQL history for phpMyAdmin';

-- --------------------------------------------------------

--
-- Table structure for table `pma__navigationhiding`
--

CREATE TABLE `pma__navigationhiding` (
  `username` varchar(64) NOT NULL,
  `item_name` varchar(64) NOT NULL,
  `item_type` varchar(64) NOT NULL,
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Hidden items of navigation tree';

-- --------------------------------------------------------

--
-- Table structure for table `pma__pdf_pages`
--

CREATE TABLE `pma__pdf_pages` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `page_nr` int(10) UNSIGNED NOT NULL,
  `page_descr` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='PDF relation pages for phpMyAdmin';

-- --------------------------------------------------------

--
-- Table structure for table `pma__recent`
--

CREATE TABLE `pma__recent` (
  `username` varchar(64) NOT NULL,
  `tables` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Recently accessed tables';

--
-- Dumping data for table `pma__recent`
--

INSERT INTO `pma__recent` (`username`, `tables`) VALUES
('root', '[{\"db\":\"mysql\",\"table\":\"user\"},{\"db\":\"hospi\",\"table\":\"visit\"},{\"db\":\"hospi\",\"table\":\"doctor\"},{\"db\":\"hospi\",\"table\":\"procedure\"},{\"db\":\"hospi\",\"table\":\"payments\"},{\"db\":\"hospi\",\"table\":\"invoice\"},{\"db\":\"hospi\",\"table\":\"process\"},{\"db\":\"hospi\",\"table\":\"featursplans\"},{\"db\":\"hospi\",\"table\":\"featurs\"},{\"db\":\"hospi\",\"table\":\"clinics\"}]');

-- --------------------------------------------------------

--
-- Table structure for table `pma__relation`
--

CREATE TABLE `pma__relation` (
  `master_db` varchar(64) NOT NULL DEFAULT '',
  `master_table` varchar(64) NOT NULL DEFAULT '',
  `master_field` varchar(64) NOT NULL DEFAULT '',
  `foreign_db` varchar(64) NOT NULL DEFAULT '',
  `foreign_table` varchar(64) NOT NULL DEFAULT '',
  `foreign_field` varchar(64) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Relation table';

-- --------------------------------------------------------

--
-- Table structure for table `pma__savedsearches`
--

CREATE TABLE `pma__savedsearches` (
  `id` int(5) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL DEFAULT '',
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `search_name` varchar(64) NOT NULL DEFAULT '',
  `search_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Saved searches';

-- --------------------------------------------------------

--
-- Table structure for table `pma__table_coords`
--

CREATE TABLE `pma__table_coords` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `pdf_page_number` int(11) NOT NULL DEFAULT 0,
  `x` float UNSIGNED NOT NULL DEFAULT 0,
  `y` float UNSIGNED NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Table coordinates for phpMyAdmin PDF output';

-- --------------------------------------------------------

--
-- Table structure for table `pma__table_info`
--

CREATE TABLE `pma__table_info` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `display_field` varchar(64) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Table information for phpMyAdmin';

--
-- Dumping data for table `pma__table_info`
--

INSERT INTO `pma__table_info` (`db_name`, `table_name`, `display_field`) VALUES
('hospi', 'invoice', 'status'),
('hospi', 'patient', 'name'),
('hospi', 'payments', 'method'),
('hospi', 'procedure', 'description'),
('hospi', 'process', 'name_process'),
('hospi', 'reception', 'name'),
('hospi', 'visit', 'patient_name');

-- --------------------------------------------------------

--
-- Table structure for table `pma__table_uiprefs`
--

CREATE TABLE `pma__table_uiprefs` (
  `username` varchar(64) NOT NULL,
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL,
  `prefs` text NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Tables'' UI preferences';

--
-- Dumping data for table `pma__table_uiprefs`
--

INSERT INTO `pma__table_uiprefs` (`username`, `db_name`, `table_name`, `prefs`, `last_update`) VALUES
('root', 'hospi', 'patient', '[]', '2025-06-19 15:17:21'),
('root', 'hospi', 'payments', '{\"sorted_col\":\"`id` ASC\",\"CREATE_TIME\":\"2025-09-03 20:42:44\",\"col_order\":[0,1,2,3,4,5,6,8,7,11,9,10,12],\"col_visib\":[1,1,1,1,1,1,1,1,1,1,1,1,1]}', '2025-09-06 05:27:52'),
('root', 'hospi', 'procedure', '{\"sorted_col\":\"`date_performed` DESC\"}', '2025-09-07 09:16:19'),
('root', 'hospi', 'visit', '{\"sorted_col\":\"`id` ASC\"}', '2025-09-15 15:48:55');

-- --------------------------------------------------------

--
-- Table structure for table `pma__tracking`
--

CREATE TABLE `pma__tracking` (
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL,
  `version` int(10) UNSIGNED NOT NULL,
  `date_created` datetime NOT NULL,
  `date_updated` datetime NOT NULL,
  `schema_snapshot` text NOT NULL,
  `schema_sql` text DEFAULT NULL,
  `data_sql` longtext DEFAULT NULL,
  `tracking` set('UPDATE','REPLACE','INSERT','DELETE','TRUNCATE','CREATE DATABASE','ALTER DATABASE','DROP DATABASE','CREATE TABLE','ALTER TABLE','RENAME TABLE','DROP TABLE','CREATE INDEX','DROP INDEX','CREATE VIEW','ALTER VIEW','DROP VIEW') DEFAULT NULL,
  `tracking_active` int(1) UNSIGNED NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Database changes tracking for phpMyAdmin';

-- --------------------------------------------------------

--
-- Table structure for table `pma__userconfig`
--

CREATE TABLE `pma__userconfig` (
  `username` varchar(64) NOT NULL,
  `timevalue` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `config_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='User preferences storage for phpMyAdmin';

--
-- Dumping data for table `pma__userconfig`
--

INSERT INTO `pma__userconfig` (`username`, `timevalue`, `config_data`) VALUES
('root', '2025-09-18 21:52:34', '{\"Console\\/Mode\":\"show\",\"Console\\/Height\":219.986400000000003274180926382541656494140625,\"NavigationWidth\":0}');

-- --------------------------------------------------------

--
-- Table structure for table `pma__usergroups`
--

CREATE TABLE `pma__usergroups` (
  `usergroup` varchar(64) NOT NULL,
  `tab` varchar(64) NOT NULL,
  `allowed` enum('Y','N') NOT NULL DEFAULT 'N'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='User groups with configured menu items';

-- --------------------------------------------------------

--
-- Table structure for table `pma__users`
--

CREATE TABLE `pma__users` (
  `username` varchar(64) NOT NULL,
  `usergroup` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Users and their assignments to user groups';

--
-- Indexes for dumped tables
--

--
-- Indexes for table `pma__bookmark`
--
ALTER TABLE `pma__bookmark`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `pma__central_columns`
--
ALTER TABLE `pma__central_columns`
  ADD PRIMARY KEY (`db_name`,`col_name`);

--
-- Indexes for table `pma__column_info`
--
ALTER TABLE `pma__column_info`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `db_name` (`db_name`,`table_name`,`column_name`);

--
-- Indexes for table `pma__designer_settings`
--
ALTER TABLE `pma__designer_settings`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `pma__export_templates`
--
ALTER TABLE `pma__export_templates`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `u_user_type_template` (`username`,`export_type`,`template_name`);

--
-- Indexes for table `pma__favorite`
--
ALTER TABLE `pma__favorite`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `pma__history`
--
ALTER TABLE `pma__history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `username` (`username`,`db`,`table`,`timevalue`);

--
-- Indexes for table `pma__navigationhiding`
--
ALTER TABLE `pma__navigationhiding`
  ADD PRIMARY KEY (`username`,`item_name`,`item_type`,`db_name`,`table_name`);

--
-- Indexes for table `pma__pdf_pages`
--
ALTER TABLE `pma__pdf_pages`
  ADD PRIMARY KEY (`page_nr`),
  ADD KEY `db_name` (`db_name`);

--
-- Indexes for table `pma__recent`
--
ALTER TABLE `pma__recent`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `pma__relation`
--
ALTER TABLE `pma__relation`
  ADD PRIMARY KEY (`master_db`,`master_table`,`master_field`),
  ADD KEY `foreign_field` (`foreign_db`,`foreign_table`);

--
-- Indexes for table `pma__savedsearches`
--
ALTER TABLE `pma__savedsearches`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `u_savedsearches_username_dbname` (`username`,`db_name`,`search_name`);

--
-- Indexes for table `pma__table_coords`
--
ALTER TABLE `pma__table_coords`
  ADD PRIMARY KEY (`db_name`,`table_name`,`pdf_page_number`);

--
-- Indexes for table `pma__table_info`
--
ALTER TABLE `pma__table_info`
  ADD PRIMARY KEY (`db_name`,`table_name`);

--
-- Indexes for table `pma__table_uiprefs`
--
ALTER TABLE `pma__table_uiprefs`
  ADD PRIMARY KEY (`username`,`db_name`,`table_name`);

--
-- Indexes for table `pma__tracking`
--
ALTER TABLE `pma__tracking`
  ADD PRIMARY KEY (`db_name`,`table_name`,`version`);

--
-- Indexes for table `pma__userconfig`
--
ALTER TABLE `pma__userconfig`
  ADD PRIMARY KEY (`username`);

--
-- Indexes for table `pma__usergroups`
--
ALTER TABLE `pma__usergroups`
  ADD PRIMARY KEY (`usergroup`,`tab`,`allowed`);

--
-- Indexes for table `pma__users`
--
ALTER TABLE `pma__users`
  ADD PRIMARY KEY (`username`,`usergroup`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `pma__bookmark`
--
ALTER TABLE `pma__bookmark`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pma__column_info`
--
ALTER TABLE `pma__column_info`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pma__export_templates`
--
ALTER TABLE `pma__export_templates`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `pma__history`
--
ALTER TABLE `pma__history`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pma__pdf_pages`
--
ALTER TABLE `pma__pdf_pages`
  MODIFY `page_nr` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pma__savedsearches`
--
ALTER TABLE `pma__savedsearches`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- Database: `test`
--
CREATE DATABASE IF NOT EXISTS `test` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `test`;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
